*PROCESS M;
 PLIFORM:  PROCEDURE(PARM) OPTIONS(MAIN) REORDER;

 DECLARE  PGMID  CHAR(35) VARYING STATIC EXTERNAL
     INIT('PLIFORM V2.0  BY CLYDE THOMAS ZUBER');
 DECLARE  PLIXOPT  CHAR(9) VARYING STATIC EXTERNAL INIT('ISA(128K)');

 /*********************************************************************/
 /*                                                                   */
 /* PLIFORM IS DESIGNED TO MAKE MODIFICATIONS EASY.  THIS PROCEDURE   */
 /* SHOULD ONLY NEED RECOMPILED WHEN DEFAULT CONTROL TABLE SETTINGS   */
 /* MUST BE CHANGED.  THE CSECT PGMID MAY BE UPDATED BY ZAP AND WILL  */
 /* BE PASSED TO THE APPROPRIATE SUBORDINATE MODULES.                 */
 /*                                                                   */
 /* THIS IS THE CONTROL DRIVER FOR THE PLIFORM PROGRAM SET.  THIS     */
 /* PROCEDURE FETCHES THE APPROPRIATE MODULES BASED UPON THE PROGRAM  */
 /* PARAMETER.  NORMAL DEFAULT EXECUTING IS TO ENTER A SYSIN CONTROL  */
 /* LOOP WITHIN MODULE PLIFCNT AND THEN EXECUTE THE PLIFORM LOGIC     */
 /* MODULE PLIFEXC.  OTHER OPTIONS ARE TO PROCESS CONTROL THROUGH     */
 /* PROGRAM PARAMETERS OR THROUGH A FULL SCREEN INTERACTIVE SELECTION */
 /* MODULE, PLIFPRM AND PLIFSCR RESPECTIVELY.                         */
 /*                                                                   */
 /*********************************************************************/
 /*********************************************************************/
 /*                                                                   */
 /* PURPOSE:  INPUT A PL/I SOURCE PROGRAM AND OUTPUT THE SAME LOGICAL */
 /*           PROGRAM WITH THE SOURCE FORMATTED TO THE SPECIFICATIONS */
 /*           SELECTED BY THE USER.                                   */
 /*                                                                   */
 /* METHOD:   THE PROGRAM IS BROKEN DOWN TO TOKENS AND RECONSTRUCTED  */
 /*           FROM SCRATCH.  COMMENTS ARE PROCESSED AS A TOKEN.       */
 /*                                                                   */
 /* INPUT:    THE INPUT SOURCE PROGRAM MAY BE IN EITHER FIXED 80 BYTE */
 /*           RECORDS OR IN VARIABLE 100 BYTE RECORDS (LRECL 104).    */
 /*                                                                   */
 /* OUTPUT:   THE OUTPUT DEFAULTS OT FIXED 80 BYTE RECORDS BUT BY     */
 /*           USER CONTROL MAY BE SELECTED TO 100 BYTE VARIABLE       */
 /*           RECORDS.                                                */
 /*                                                                   */
 /*********************************************************************/
1/*********************************************************************/
 /*                                                                   */
 /* PARAMETER    EXPLANATION                                          */
 /* =========    ===========                                          */
 /*                                                                   */
 /* (NONE)       PLIFCNT WILL BE SELECTED TO ENTER A SYSIN LINE       */
 /*              ORIENTED CONTROL LOOP.                               */
 /*                                                                   */
 /* DEFAULT      NO CONTROL MODULE WILL BE ENTERED AND DEFAULT        */
 /*              OPTIONS WILL BE IN CONTROL.                          */
 /*                                                                   */
 /* SCREEN       PLIFSCR WILL BE SELECTED TO ENTER A FULL SCREEN      */
 /*              ORIENTED CONTROL PROCESS.  CAN ONLY BE USED UNDER    */
 /*              TSO WITH FULL SCREEN SUPPORT.                        */
 /*                                                                   */
 /* (OTHERS)     PLIFPRM WILL BE SELECTED TO PARSE AND SELECT OPTIONS */
 /*              BY THE PARAMETER STRING.  SEE PLIFPRM FOR LIST OF    */
 /*              VALID CONTROL PARAMETERS, THIS PROCEDURE DOES NOT    */
 /*              PROCESS THEM.                                        */
 /*                                                                   */
 /*********************************************************************/

 DECLARE  PARM  CHAR(100) VARYING;
 DECLARE  SYSPRINT  FILE OUTPUT STREAM PRINT;
 DECLARE  (PLIFCNT, PLIFEXC, PLIFPRM, PLIFSCR)  ENTRY;

 %DCL  TABLE_HIGH          FIXED;
 %DCL  MAX_KEYWORD_LENGTH  FIXED;
 %DCL  MAX_ABREV_LENGTH    FIXED;
 %TABLE_HIGH         = 365;
 %MAX_KEYWORD_LENGTH = 16;
 %MAX_ABREV_LENGTH   = 8;
 %DCL  ABREV_NOSUB  CHAR;
 %DCL  ABREV___SUB  CHAR;
 %DCL  KEYWD_NOSUB  CHAR;
 %DCL  KEYWORD_SUB  CHAR;
 %DCL  LEAVE_NOSUB  CHAR;
 %DCL  LEAVE___SUB  CHAR;
 %DCL  NO_WAY       CHAR;
 %DCL  YES_DO       CHAR;
 %/* FIRST WORD INDICATES WHICH TABLE TO USE FOR OUTPUT */;
 %/* SUB MEANS ALLOW USER TO CHANGE TO ANOTHER VALUE */;
 %ABREV_NOSUB   = '''010''B';
 %ABREV___SUB   = '''011''B';
 %KEYWD_NOSUB   = '''100''B';
 %KEYWORD_SUB   = '''101''B';
 %LEAVE_NOSUB   = '''110''B';
 %LEAVE___SUB   = '''111''B';
 %NO_WAY        = '''0''B';
 %YES_DO        = '''1''B';
1DECLARE  KEYWORD(TABLE_HIGH)  CHAR(MAX_KEYWORD_LENGTH) VARYING
    STATIC INIT(
              /*   1 */   '<',
              /*   2 */   '<=',
              /*   3 */   '(',
              /*   4 */   '+',
              /*   5 */   '|',
              /*   6 */   '||',
              /*   7 */   '&',
              /*   8 */   '*',
              /*   9 */   '**',
              /*  10 */   ')',
              /*  11 */   ';',
              /*  12 */   'ª',
              /*  13 */   'ª<',
              /*  14 */   'ª>',
              /*  15 */   'ª=',
              /*  16 */   '-',
              /*  17 */   '->',
              /*  18 */   '/',
              /*  19 */   ',',
              /*  20 */   '%',
              /*  21 */   '%ACTIVATE',
              /*  22 */   '%CONTROL',
              /*  23 */   '%DEACTIVATE',
              /*  24 */   '%DECLARE',
              /*  25 */   '%DO',
              /*  26 */   '%ELSE',
              /*  27 */   '%END',
              /*  28 */   '%GO', /* TO */
              /*  29 */   '%IF',
              /*  30 */   '%INCLUDE',
              /*  31 */   '%NOPRINT',
              /*  32 */   '%NOTE',
              /*  33 */   '%PAGE',
              /*  34 */   '%PRINT',
              /*  35 */   '%PROCEDURE',
              /*  36 */   '%SKIP',
              /*  37 */   '%THEN',
              /*  38 */   '>',
              /*  39 */   '>=',
              /*  40 */   ':',
              /*  41 */   '=',
              /*  42 */   'A',
1             /*  43 */   'ABS',
              /*  44 */   'ACOS',
              /*  45 */   'ADD',
              /*  46 */   'ADDBUFF',
              /*  47 */   'ADDR',
              /*  48 */   'ALIGNED',
              /*  49 */   'ALL',
              /*  50 */   'ALLOCATE',
              /*  51 */   'ALLOCATION',
              /*  52 */   'ANY',
              /*  53 */   'AREA',
              /*  54 */   'ASCII',
              /*  55 */   'ASIN',
              /*  56 */   'ASSEMBLER',
              /*  57 */   'ATAN',
              /*  58 */   'ATAND',
              /*  59 */   'ATANH',
              /*  60 */   'ATTENTION',
              /*  61 */   'AUTOMATIC',
              /*  62 */   'B',
              /*  63 */   'BACKWARDS',
              /*  64 */   'BASED',
              /*  65 */   'BEGIN',
              /*  66 */   'BINARY',
              /*  67 */   'BIT',
              /*  68 */   'BKWD',
              /*  69 */   'BLKSIZE',
              /*  70 */   'BOOL',
              /*  71 */   'BUFFERED',
              /*  72 */   'BUFFERS',
              /*  73 */   'BUFND',
              /*  74 */   'BUFNI',
              /*  75 */   'BUFSP',
              /*  76 */   'BUFOFF',
              /*  77 */   'BUILTIN',
              /*  78 */   'BY',
              /*  79 */   'BYNAME',
              /*  80 */   'C',
              /*  81 */   'CALL',
              /*  82 */   'CEIL',
              /*  83 */   'CHAR',
              /*  84 */   'CHARACTER',
              /*  85 */   'CHECK',
              /*  86 */   'CLOSE',
1             /*  87 */   'COBOL',
              /*  88 */   'COLUMN',
              /*  89 */   'COMPILETIME',
              /*  90 */   'COMPLETION',
              /*  91 */   'COMPLEX',
              /*  92 */   'CONDITION',
              /*  93 */   'CONJG',
              /*  94 */   'CONNECTED',
              /*  95 */   'CONSECUTIVE',
              /*  96 */   'CONTROLLED',
              /*  97 */   'CONVERSION',
              /*  98 */   'COPY',
              /*  99 */   'COS',
              /* 100 */   'COSD',
              /* 101 */   'COSH',
              /* 102 */   'COUNT',
              /* 103 */   'COUNTER',
              /* 104 */   'CTLASA',
              /* 105 */   'CTL360',
              /* 106 */   'CURRENTSTORAGE',
              /* 107 */   'D',
              /* 108 */   'DATA',
              /* 109 */   'DATAFIELD',
              /* 110 */   'DATE',
              /* 111 */   'DB',
              /* 112 */   'DECIMAL',
              /* 113 */   'DECLARE',
              /* 114 */   'DEFAULT',
              /* 115 */   'DEFINED',
              /* 116 */   'DELAY',
              /* 117 */   'DELETE',
              /* 118 */   'DESCRIPTORS',
              /* 119 */   'DIM',
              /* 120 */   'DIRECT',
              /* 121 */   'DISPLAY',
              /* 122 */   'DIVIDE',
              /* 123 */   'DO',
              /* 124 */   'E',
              /* 125 */   'EDIT',
              /* 126 */   'ELSE',
              /* 127 */   'EMPTY',
              /* 128 */   'END',
              /* 129 */   'ENDFILE',
              /* 130 */   'ENDPAGE',
1             /* 131 */   'ENTRY',
              /* 132 */   'ENVIRONMENT',
              /* 133 */   'ERF',
              /* 134 */   'ERFC',
              /* 135 */   'ERROR',
              /* 136 */   'EVENT',
              /* 137 */   'EXCLUSIVE',
              /* 138 */   'EXIT',
              /* 139 */   'EXP',
              /* 140 */   'EXTERNAL',
              /* 141 */   'F',
              /* 142 */   'FB',
              /* 143 */   'FBS',
              /* 144 */   'FETCH',
              /* 145 */   'FILE',
              /* 146 */   'FINISH',
              /* 147 */   'FIXED',
              /* 148 */   'FIXEDOVERFLOW',
              /* 149 */   'FLOAT',
              /* 150 */   'FLOOR',
              /* 151 */   'FLOW',
              /* 152 */   'FORMAT',
              /* 153 */   'FORTRAN',
              /* 154 */   'FREE',
              /* 155 */   'FROM',
              /* 156 */   'FS',
              /* 157 */   'GENERIC',
              /* 158 */   'GENKEY',
              /* 159 */   'GET',
              /* 160 */   'GO', /* TO */
              /* 161 */   'HALT',
              /* 162 */   'HBOUND',
              /* 163 */   'HIGH',
              /* 164 */   'IF',
              /* 165 */   'IGNORE',
              /* 166 */   'IMAG',
              /* 167 */   'IN',
              /* 168 */   'INDEX',
              /* 169 */   'INDEXAREA',
              /* 170 */   'INDEXED',
              /* 171 */   'INITIAL',
              /* 172 */   'INPUT',
              /* 173 */   'INTER',
              /* 174 */   'INTERNAL',
1             /* 175 */   'INTO',
              /* 176 */   'IRREDUCIBLE',
              /* 177 */   'KEY',
              /* 178 */   'KEYED',
              /* 179 */   'KEYFROM',
              /* 180 */   'KEYLENGTH',
              /* 181 */   'KEYLOC',
              /* 182 */   'KEYTO',
              /* 183 */   'LABEL',
              /* 184 */   'LBOUND',
              /* 185 */   'LEAVE',
              /* 186 */   'LENGTH',
              /* 187 */   'LIKE',
              /* 188 */   'LINE',
              /* 189 */   'LINENO',
              /* 190 */   'LINESIZE',
              /* 191 */   'LIST',
              /* 192 */   'LOCATE',
              /* 193 */   'LOG',
              /* 194 */   'LOG2',
              /* 195 */   'LOG10',
              /* 196 */   'LOW',
              /* 197 */   'MAIN',
              /* 198 */   'MAX',
              /* 199 */   'MIN',
              /* 200 */   'MOD',
              /* 201 */   'MULTIPLY',
              /* 202 */   'NAME',
              /* 203 */   'NCP',
              /* 204 */   'NOCHECK',
              /* 205 */   'NOCONVERSION',
              /* 206 */   'NOFIXEDOVERFLOW',
              /* 207 */   'NOFLOW',
              /* 208 */   'NOFORMAT',
              /* 209 */   'NOLOCK',
              /* 210 */   'NOMAP',
              /* 211 */   'NOMAPIN',
              /* 212 */   'NOMAPOUT',
              /* 213 */   'NOOVERFLOW',
              /* 214 */   'NORESCAN',
              /* 215 */   'NOSIZE',
              /* 216 */   'NOSTRINGRANGE',
              /* 217 */   'NOSTRINGSIZE',
              /* 218 */   'NOSUBSCRIPTRANGE',
1             /* 219 */   'NOUNDERFLOW',
              /* 220 */   'NOWRITE',
              /* 221 */   'NOZERODIVIDE',
              /* 222 */   'NULL',
              /* 223 */   'OFFSET',
              /* 224 */   'ON',
              /* 225 */   'ONCHAR',
              /* 226 */   'ONCODE',
              /* 227 */   'ONCOUNT',
              /* 228 */   'ONFILE',
              /* 229 */   'ONKEY',
              /* 230 */   'ONLOC',
              /* 231 */   'ONSOURCE',
              /* 232 */   'OPEN',
              /* 233 */   'OPTIONS',
              /* 234 */   'ORDER',
              /* 235 */   'OTHERWISE',
              /* 236 */   'OUTPUT',
              /* 237 */   'OVERFLOW',
              /* 238 */   'P',
              /* 239 */   'PAGE',
              /* 240 */   'PAGESIZE',
              /* 241 */   'PARMSET',
              /* 242 */   'PASSWORD',
              /* 243 */   'PENDING',
              /* 244 */   'PICTURE',
              /* 245 */   'PLIRETV',
              /* 246 */   'POINTER',
              /* 247 */   'POLY',
              /* 248 */   'POSITION',
              /* 249 */   'PRECISION',
              /* 250 */   'PRINT',
              /* 251 */   'PRIORITY',
              /* 252 */   'PROCEDURE',
              /* 253 */   'PROD',
              /* 254 */   'PUT',
              /* 255 */   'R',
              /* 256 */   'RANGE',
              /* 257 */   'READ',
              /* 258 */   'REAL',
              /* 259 */   'RECORD',
              /* 260 */   'RECSIZE',
              /* 261 */   'RECURSIVE',
              /* 262 */   'REDUCIBLE',
1             /* 263 */   'REENTRANT',
              /* 264 */   'REFER',
              /* 265 */   'REGIONAL',
              /* 266 */   'RELEASE',
              /* 267 */   'REORDER',
              /* 268 */   'REPEAT',
              /* 269 */   'REPLY',
              /* 270 */   'REREAD',
              /* 271 */   'RESCAN',
              /* 272 */   'RETCODE',
              /* 273 */   'RETURN',
              /* 274 */   'RETURNS',
              /* 275 */   'REUSE',
              /* 276 */   'REVERT',
              /* 277 */   'REWRITE',
              /* 278 */   'ROUND',
              /* 279 */   'SAMEKEY',
              /* 280 */   'SCALARVARYING',
              /* 281 */   'SELECT',
              /* 282 */   'SEQUENTIAL',
              /* 283 */   'SET',
              /* 284 */   'SIGN',
              /* 285 */   'SIGNAL',
              /* 286 */   'SIN',
              /* 287 */   'SIND',
              /* 288 */   'SINH',
              /* 289 */   'SIS',
              /* 290 */   'SIZE',
              /* 291 */   'SKIP',
              /* 292 */   'SNAP',
              /* 293 */   'SQRT',
              /* 294 */   'STATEMENT',
              /* 295 */   'STATIC',
              /* 296 */   'STATUS',
              /* 297 */   'STOP',
              /* 298 */   'STORAGE',
              /* 299 */   'STREAM',
              /* 300 */   'STRING',
              /* 301 */   'STRINGRANGE',
              /* 302 */   'STRINGSIZE',
              /* 303 */   'SUBSCRIPTRANGE',
              /* 304 */   'SUBSTR',
              /* 305 */   'SUM',
              /* 306 */   'SYSIN',
1             /* 307 */   'SYSPRINT',
              /* 308 */   'SYSTEM',
              /* 309 */   'TAN',
              /* 310 */   'TAND',
              /* 311 */   'TANH',
              /* 312 */   'TASK',
              /* 313 */   'THEN',
              /* 314 */   'TIME',
              /* 315 */   'TITLE',
              /* 316 */   'TO',
              /* 317 */   'TOTAL',
              /* 318 */   'TP',
              /* 319 */   'TRANSIENT',
              /* 320 */   'TRANSLATE',
              /* 321 */   'TRANSMIT',
              /* 322 */   'TRKOFL',
              /* 323 */   'TRUNC',
              /* 324 */   'U',
              /* 325 */   'UNALIGNED',
              /* 326 */   'UNBUFFERED',
              /* 327 */   'UNDEFINEDFILE',
              /* 328 */   'UNDERFLOW',
              /* 329 */   'UNLOCK',
              /* 330 */   'UNSPEC',
              /* 331 */   'UNTIL',
              /* 332 */   'UPDATE',
              /* 333 */   'V',
              /* 334 */   'VALUE',
              /* 335 */   'VARIABLE',
              /* 336 */   'VARYING',
              /* 337 */   'VB',
              /* 338 */   'VBS',
              /* 339 */   'VERIFY',
              /* 340 */   'VS',
              /* 341 */   'VSAM',
              /* 342 */   'WAIT',
              /* 343 */   'WHEN',
              /* 344 */   'WHILE',
              /* 345 */   'WRITE',
              /* 346 */   'X',
              /* 347 */   'ZERODIVIDE',
              /* 348 */   '01',
              /* 349 */   '02',
              /* 350 */   '03',
1             /* 351 */   '04',
              /* 352 */   '05',
              /* 353 */   '06',
              /* 354 */   '07',
              /* 355 */   '08',
              /* 356 */   '09',
              /* 357 */   '1',
              /* 358 */   '2',
              /* 359 */   '3',
              /* 360 */   '4',
              /* 361 */   '5',
              /* 362 */   '6',
              /* 363 */   '7',
              /* 364 */   '8',
              /* 365 */   '9');
1DECLARE  ABREVIATION(TABLE_HIGH)  CHAR(MAX_ABREV_LENGTH) VARYING
     STATIC INIT(
              /*   1 */   '',
              /*   2 */   '',
              /*   3 */   '',
              /*   4 */   '',
              /*   5 */   '',
              /*   6 */   '',
              /*   7 */   '',
              /*   8 */   '',
              /*   9 */   '',
              /*  10 */   '',
              /*  11 */   '',
              /*  12 */   '',
              /*  13 */   '',
              /*  14 */   '',
              /*  15 */   '',
              /*  16 */   '',
              /*  17 */   '',
              /*  18 */   '',
              /*  19 */   '',
              /*  20 */   '',
              /*  21 */   '%ACT',
              /*  22 */   '',
              /*  23 */   '%DEACT',
              /*  24 */   '%DCL',
              /*  25 */   '',
              /*  26 */   '',
              /*  27 */   '',
              /*  28 */   '%GOTO',
              /*  29 */   '',
              /*  30 */   '',
              /*  31 */   '',
              /*  32 */   '',
              /*  33 */   '',
              /*  34 */   '',
              /*  35 */   '%PROC',
              /*  36 */   '',
              /*  37 */   '',
              /*  38 */   '',
              /*  39 */   '',
              /*  40 */   '',
              /*  41 */   '',
              /*  42 */   '',
1             /*  43 */   '',
              /*  44 */   '',
              /*  45 */   '',
              /*  46 */   '',
              /*  47 */   '',
              /*  48 */   '',
              /*  49 */   '',
              /*  50 */   'ALLOC',
              /*  51 */   'ALLOCN',
              /*  52 */   '',
              /*  53 */   '',
              /*  54 */   '',
              /*  55 */   '',
              /*  56 */   'ASM',
              /*  57 */   '',
              /*  58 */   '',
              /*  59 */   '',
              /*  60 */   'ATTN',
              /*  61 */   'AUTO',
              /*  62 */   '',
              /*  63 */   '',
              /*  64 */   '',
              /*  65 */   '',
              /*  66 */   'BIN',
              /*  67 */   '',
              /*  68 */   '',
              /*  69 */   '',
              /*  70 */   '',
              /*  71 */   'BUF',
              /*  72 */   '',
              /*  73 */   '',
              /*  74 */   '',
              /*  75 */   '',
              /*  76 */   '',
              /*  77 */   '',
              /*  78 */   '',
              /*  79 */   '',
              /*  80 */   '',
              /*  81 */   '',
              /*  82 */   '',
              /*  83 */   '',
              /*  84 */   'CHAR',
              /*  85 */   '',
              /*  86 */   '',
1             /*  87 */   '',
              /*  88 */   'COL',
              /*  89 */   '',
              /*  90 */   'CPLN',
              /*  91 */   'CPLX',
              /*  92 */   'COND',
              /*  93 */   '',
              /*  94 */   'CONN',
              /*  95 */   '',
              /*  96 */   'CTL',
              /*  97 */   'CONV',
              /*  98 */   '',
              /*  99 */   '',
              /* 100 */   '',
              /* 101 */   '',
              /* 102 */   '',
              /* 103 */   '',
              /* 104 */   '',
              /* 105 */   '',
              /* 106 */   'CSTG',
              /* 107 */   '',
              /* 108 */   '',
              /* 109 */   '',
              /* 110 */   '',
              /* 111 */   '',
              /* 112 */   'DEC',
              /* 113 */   'DCL',
              /* 114 */   'DFT',
              /* 115 */   'DEF',
              /* 116 */   '',
              /* 117 */   '',
              /* 118 */   '',
              /* 119 */   '',
              /* 120 */   '',
              /* 121 */   '',
              /* 122 */   '',
              /* 123 */   '',
              /* 124 */   '',
              /* 125 */   '',
              /* 126 */   '',
              /* 127 */   '',
              /* 128 */   '',
              /* 129 */   '',
              /* 130 */   '',
1             /* 131 */   '',
              /* 132 */   'ENV',
              /* 133 */   '',
              /* 134 */   '',
              /* 135 */   '',
              /* 136 */   '',
              /* 137 */   'EXCL',
              /* 138 */   '',
              /* 139 */   '',
              /* 140 */   'EXT',
              /* 141 */   '',
              /* 142 */   '',
              /* 143 */   '',
              /* 144 */   '',
              /* 145 */   '',
              /* 146 */   '',
              /* 147 */   '',
              /* 148 */   'FOFL',
              /* 149 */   '',
              /* 150 */   '',
              /* 151 */   '',
              /* 152 */   '',
              /* 153 */   '',
              /* 154 */   '',
              /* 155 */   '',
              /* 156 */   '',
              /* 157 */   '',
              /* 158 */   '',
              /* 159 */   '',
              /* 160 */   'GOTO',
              /* 161 */   '',
              /* 162 */   '',
              /* 163 */   '',
              /* 164 */   '',
              /* 165 */   '',
              /* 166 */   '',
              /* 167 */   '',
              /* 168 */   '',
              /* 169 */   '',
              /* 170 */   '',
              /* 171 */   'INIT',
              /* 172 */   '',
              /* 173 */   '',
              /* 174 */   'INT',
1             /* 175 */   '',
              /* 176 */   'IRRED',
              /* 177 */   '',
              /* 178 */   '',
              /* 179 */   '',
              /* 180 */   '',
              /* 181 */   '',
              /* 182 */   '',
              /* 183 */   '',
              /* 184 */   '',
              /* 185 */   '',
              /* 186 */   '',
              /* 187 */   '',
              /* 188 */   '',
              /* 189 */   '',
              /* 190 */   '',
              /* 191 */   '',
              /* 192 */   '',
              /* 193 */   '',
              /* 194 */   '',
              /* 195 */   '',
              /* 196 */   '',
              /* 197 */   '',
              /* 198 */   '',
              /* 199 */   '',
              /* 200 */   '',
              /* 201 */   '',
              /* 202 */   '',
              /* 203 */   '',
              /* 204 */   '',
              /* 205 */   'NOCONV',
              /* 206 */   'NOFOFL',
              /* 207 */   '',
              /* 208 */   '',
              /* 209 */   '',
              /* 210 */   '',
              /* 211 */   '',
              /* 212 */   '',
              /* 213 */   'NOOFL',
              /* 214 */   '',
              /* 215 */   '',
              /* 216 */   'NOSTRG',
              /* 217 */   'NOSTRZ',
              /* 218 */   'NOSUBRG',
1             /* 219 */   'NOUFL',
              /* 220 */   '',
              /* 221 */   'NOZDIV',
              /* 222 */   '',
              /* 223 */   '',
              /* 224 */   '',
              /* 225 */   '',
              /* 226 */   '',
              /* 227 */   '',
              /* 228 */   '',
              /* 229 */   '',
              /* 230 */   '',
              /* 231 */   '',
              /* 232 */   '',
              /* 233 */   '',
              /* 234 */   '',
              /* 235 */   'OTHER',
              /* 236 */   '',
              /* 237 */   'OFL',
              /* 238 */   '',
              /* 239 */   '',
              /* 240 */   '',
              /* 241 */   '',
              /* 242 */   '',
              /* 243 */   '',
              /* 244 */   'PIC',
              /* 245 */   '',
              /* 246 */   'PTR',
              /* 247 */   '',
              /* 248 */   'POS',
              /* 249 */   'PREC',
              /* 250 */   '',
              /* 251 */   '',
              /* 252 */   'PROC',
              /* 253 */   '',
              /* 254 */   '',
              /* 255 */   '',
              /* 256 */   '',
              /* 257 */   '',
              /* 258 */   '',
              /* 259 */   '',
              /* 260 */   '',
              /* 261 */   '',
              /* 262 */   'RED',
1             /* 263 */   '',
              /* 264 */   '',
              /* 265 */   '',
              /* 266 */   '',
              /* 267 */   '',
              /* 268 */   '',
              /* 269 */   '',
              /* 270 */   '',
              /* 271 */   '',
              /* 272 */   '',
              /* 273 */   '',
              /* 274 */   '',
              /* 275 */   '',
              /* 276 */   '',
              /* 277 */   '',
              /* 278 */   '',
              /* 279 */   '',
              /* 280 */   '',
              /* 281 */   '',
              /* 282 */   'SEQL',
              /* 283 */   '',
              /* 284 */   '',
              /* 285 */   '',
              /* 286 */   '',
              /* 287 */   '',
              /* 288 */   '',
              /* 289 */   '',
              /* 290 */   '',
              /* 291 */   '',
              /* 292 */   '',
              /* 293 */   '',
              /* 294 */   '',
              /* 295 */   '',
              /* 296 */   '',
              /* 297 */   '',
              /* 298 */   'STG',
              /* 299 */   '',
              /* 300 */   '',
              /* 301 */   'STRG',
              /* 302 */   'STRZ',
              /* 303 */   'SUBRG',
              /* 304 */   '',
              /* 305 */   '',
              /* 306 */   '',
1             /* 307 */   '',
              /* 308 */   '',
              /* 309 */   '',
              /* 310 */   '',
              /* 311 */   '',
              /* 312 */   '',
              /* 313 */   '',
              /* 314 */   '',
              /* 315 */   '',
              /* 316 */   '',
              /* 317 */   '',
              /* 318 */   '',
              /* 319 */   '',
              /* 320 */   '',
              /* 321 */   '',
              /* 322 */   '',
              /* 323 */   '',
              /* 324 */   '',
              /* 325 */   'UNAL',
              /* 326 */   'UNBUF',
              /* 327 */   'UNDF',
              /* 328 */   'UFL',
              /* 329 */   '',
              /* 330 */   '',
              /* 331 */   '',
              /* 332 */   '',
              /* 333 */   '',
              /* 334 */   '',
              /* 335 */   '',
              /* 336 */   'VAR',
              /* 337 */   '',
              /* 338 */   '',
              /* 339 */   '',
              /* 340 */   '',
              /* 341 */   '',
              /* 342 */   '',
              /* 343 */   '',
              /* 344 */   '',
              /* 345 */   '',
              /* 346 */   '',
              /* 347 */   'ZDIV',
              /* 348 */   '1',
              /* 349 */   '2',
              /* 350 */   '3',
1             /* 351 */   '4',
              /* 352 */   '5',
              /* 353 */   '6',
              /* 354 */   '7',
              /* 355 */   '8',
              /* 356 */   '9',
              /* 357 */   '',
              /* 358 */   '',
              /* 359 */   '',
              /* 360 */   '',
              /* 361 */   '',
              /* 362 */   '',
              /* 363 */   '',
              /* 364 */   '',
              /* 365 */   '');
1DECLARE  CHOICE(TABLE_HIGH)  BIT(3) STATIC INIT(
 /*   1 */ LEAVE_NOSUB,  /*   2 */ LEAVE_NOSUB,  /*   3 */ LEAVE_NOSUB,
 /*   4 */ LEAVE_NOSUB,  /*   5 */ LEAVE_NOSUB,  /*   6 */ LEAVE_NOSUB,
 /*   7 */ LEAVE_NOSUB,  /*   8 */ LEAVE_NOSUB,  /*   9 */ LEAVE_NOSUB,
 /*  10 */ LEAVE_NOSUB,  /*  11 */ LEAVE_NOSUB,  /*  12 */ LEAVE_NOSUB,
 /*  13 */ LEAVE_NOSUB,  /*  14 */ LEAVE_NOSUB,  /*  15 */ LEAVE_NOSUB,
 /*  16 */ LEAVE_NOSUB,  /*  17 */ LEAVE_NOSUB,  /*  18 */ LEAVE_NOSUB,
 /*  19 */ LEAVE_NOSUB,  /*  20 */ LEAVE_NOSUB,  /*  21 */ KEYWORD_SUB,
 /*  22 */ LEAVE_NOSUB,  /*  23 */ KEYWORD_SUB,  /*  24 */ ABREV___SUB,
 /*  25 */ LEAVE_NOSUB,  /*  26 */ LEAVE_NOSUB,  /*  27 */ LEAVE_NOSUB,
 /*  28 */ LEAVE_NOSUB,  /*  29 */ LEAVE_NOSUB,  /*  30 */ LEAVE_NOSUB,
 /*  31 */ LEAVE_NOSUB,  /*  32 */ LEAVE_NOSUB,  /*  33 */ LEAVE_NOSUB,
 /*  34 */ LEAVE_NOSUB,  /*  35 */ KEYWORD_SUB,  /*  36 */ LEAVE_NOSUB,
 /*  37 */ LEAVE_NOSUB,  /*  38 */ LEAVE_NOSUB,  /*  39 */ LEAVE_NOSUB,
 /*  40 */ LEAVE_NOSUB,  /*  41 */ LEAVE_NOSUB,  /*  42 */ LEAVE_NOSUB,
 /*  43 */ LEAVE_NOSUB,  /*  44 */ LEAVE_NOSUB,  /*  45 */ LEAVE_NOSUB,
 /*  46 */ LEAVE_NOSUB,  /*  47 */ LEAVE_NOSUB,  /*  48 */ LEAVE_NOSUB,
 /*  49 */ LEAVE_NOSUB,  /*  50 */ ABREV___SUB,  /*  51 */ KEYWORD_SUB,
 /*  52 */ LEAVE_NOSUB,  /*  53 */ LEAVE_NOSUB,  /*  54 */ LEAVE_NOSUB,
 /*  55 */ LEAVE_NOSUB,  /*  56 */ ABREV___SUB,  /*  57 */ LEAVE_NOSUB,
 /*  58 */ LEAVE_NOSUB,  /*  59 */ LEAVE_NOSUB,  /*  60 */ KEYWORD_SUB,
 /*  61 */ ABREV___SUB,  /*  62 */ LEAVE_NOSUB,  /*  63 */ LEAVE_NOSUB,
 /*  64 */ LEAVE_NOSUB,  /*  65 */ LEAVE_NOSUB,  /*  66 */ KEYWORD_SUB,
 /*  67 */ LEAVE_NOSUB,  /*  68 */ LEAVE_NOSUB,  /*  69 */ LEAVE_NOSUB,
 /*  70 */ LEAVE_NOSUB,  /*  71 */ KEYWORD_SUB,  /*  72 */ LEAVE_NOSUB,
 /*  73 */ LEAVE_NOSUB,  /*  74 */ LEAVE_NOSUB,  /*  75 */ LEAVE_NOSUB,
 /*  76 */ LEAVE_NOSUB,  /*  77 */ LEAVE_NOSUB,  /*  78 */ LEAVE_NOSUB,
 /*  79 */ LEAVE_NOSUB,  /*  80 */ LEAVE_NOSUB,  /*  81 */ LEAVE_NOSUB,
 /*  82 */ LEAVE_NOSUB,  /*  83 */ LEAVE_NOSUB,  /*  84 */ ABREV___SUB,
 /*  85 */ LEAVE_NOSUB,  /*  86 */ LEAVE_NOSUB,  /*  87 */ LEAVE_NOSUB,
 /*  88 */ ABREV___SUB,  /*  89 */ LEAVE_NOSUB,  /*  90 */ KEYWORD_SUB,
 /*  91 */ KEYWORD_SUB,  /*  92 */ KEYWORD_SUB,  /*  93 */ LEAVE_NOSUB,
 /*  94 */ KEYWORD_SUB,  /*  95 */ LEAVE_NOSUB,  /*  96 */ KEYWORD_SUB,
 /*  97 */ KEYWORD_SUB,  /*  98 */ LEAVE_NOSUB,  /*  99 */ LEAVE_NOSUB,
 /* 100 */ LEAVE_NOSUB,  /* 101 */ LEAVE_NOSUB,  /* 102 */ LEAVE_NOSUB,
 /* 103 */ LEAVE_NOSUB,  /* 104 */ LEAVE_NOSUB,  /* 105 */ LEAVE_NOSUB,
 /* 106 */ KEYWORD_SUB,  /* 107 */ LEAVE_NOSUB,  /* 108 */ LEAVE_NOSUB,
 /* 109 */ LEAVE_NOSUB,  /* 110 */ LEAVE_NOSUB,  /* 111 */ LEAVE_NOSUB,
 /* 112 */ KEYWORD_SUB,  /* 113 */ KEYWORD_SUB,  /* 114 */ KEYWORD_SUB,
 /* 115 */ KEYWORD_SUB,  /* 116 */ LEAVE_NOSUB,  /* 117 */ LEAVE_NOSUB,
 /* 118 */ LEAVE_NOSUB,  /* 119 */ LEAVE_NOSUB,  /* 120 */ LEAVE_NOSUB,
 /* 121 */ LEAVE_NOSUB,  /* 122 */ LEAVE_NOSUB,  /* 123 */ LEAVE_NOSUB,
 /* 124 */ LEAVE_NOSUB,  /* 125 */ LEAVE_NOSUB,  /* 126 */ LEAVE_NOSUB,
 /* 127 */ LEAVE_NOSUB,  /* 128 */ LEAVE_NOSUB,  /* 129 */ LEAVE_NOSUB,
1/* 130 */ LEAVE_NOSUB,  /* 131 */ LEAVE_NOSUB,  /* 132 */ ABREV___SUB,
 /* 133 */ LEAVE_NOSUB,  /* 134 */ LEAVE_NOSUB,  /* 135 */ LEAVE_NOSUB,
 /* 136 */ LEAVE_NOSUB,  /* 137 */ KEYWORD_SUB,  /* 138 */ LEAVE_NOSUB,
 /* 139 */ LEAVE_NOSUB,  /* 140 */ KEYWORD_SUB,  /* 141 */ LEAVE_NOSUB,
 /* 142 */ LEAVE_NOSUB,  /* 143 */ LEAVE_NOSUB,  /* 144 */ LEAVE_NOSUB,
 /* 145 */ LEAVE_NOSUB,  /* 146 */ LEAVE_NOSUB,  /* 147 */ LEAVE_NOSUB,
 /* 148 */ KEYWORD_SUB,  /* 149 */ LEAVE_NOSUB,  /* 150 */ LEAVE_NOSUB,
 /* 151 */ LEAVE_NOSUB,  /* 152 */ LEAVE_NOSUB,  /* 153 */ LEAVE_NOSUB,
 /* 154 */ LEAVE_NOSUB,  /* 155 */ LEAVE_NOSUB,  /* 156 */ LEAVE_NOSUB,
 /* 157 */ LEAVE_NOSUB,  /* 158 */ LEAVE_NOSUB,  /* 159 */ LEAVE_NOSUB,
 /* 160 */ LEAVE_NOSUB,  /* 161 */ LEAVE_NOSUB,  /* 162 */ LEAVE_NOSUB,
 /* 163 */ LEAVE_NOSUB,  /* 164 */ LEAVE_NOSUB,  /* 165 */ LEAVE_NOSUB,
 /* 166 */ LEAVE_NOSUB,  /* 167 */ LEAVE_NOSUB,  /* 168 */ LEAVE_NOSUB,
 /* 169 */ LEAVE_NOSUB,  /* 170 */ LEAVE_NOSUB,  /* 171 */ ABREV___SUB,
 /* 172 */ LEAVE_NOSUB,  /* 173 */ LEAVE_NOSUB,  /* 174 */ KEYWORD_SUB,
 /* 175 */ LEAVE_NOSUB,  /* 176 */ KEYWORD_SUB,  /* 177 */ LEAVE_NOSUB,
 /* 178 */ LEAVE_NOSUB,  /* 179 */ LEAVE_NOSUB,  /* 180 */ LEAVE_NOSUB,
 /* 181 */ LEAVE_NOSUB,  /* 182 */ LEAVE_NOSUB,  /* 183 */ LEAVE_NOSUB,
 /* 184 */ LEAVE_NOSUB,  /* 185 */ LEAVE_NOSUB,  /* 186 */ LEAVE_NOSUB,
 /* 187 */ LEAVE_NOSUB,  /* 188 */ LEAVE_NOSUB,  /* 189 */ LEAVE_NOSUB,
 /* 190 */ LEAVE_NOSUB,  /* 191 */ LEAVE_NOSUB,  /* 192 */ LEAVE_NOSUB,
 /* 193 */ LEAVE_NOSUB,  /* 194 */ LEAVE_NOSUB,  /* 195 */ LEAVE_NOSUB,
 /* 196 */ LEAVE_NOSUB,  /* 197 */ LEAVE_NOSUB,  /* 198 */ LEAVE_NOSUB,
 /* 199 */ LEAVE_NOSUB,  /* 200 */ LEAVE_NOSUB,  /* 201 */ LEAVE_NOSUB,
 /* 202 */ LEAVE_NOSUB,  /* 203 */ LEAVE_NOSUB,  /* 204 */ LEAVE_NOSUB,
 /* 205 */ KEYWORD_SUB,  /* 206 */ KEYWORD_SUB,  /* 207 */ LEAVE_NOSUB,
 /* 208 */ LEAVE_NOSUB,  /* 209 */ LEAVE_NOSUB,  /* 210 */ LEAVE_NOSUB,
 /* 211 */ LEAVE_NOSUB,  /* 212 */ LEAVE_NOSUB,  /* 213 */ KEYWORD_SUB,
 /* 214 */ LEAVE_NOSUB,  /* 215 */ LEAVE_NOSUB,  /* 216 */ KEYWORD_SUB,
 /* 217 */ KEYWORD_SUB,  /* 218 */ KEYWORD_SUB,  /* 219 */ KEYWORD_SUB,
 /* 220 */ LEAVE_NOSUB,  /* 221 */ KEYWORD_SUB,  /* 222 */ LEAVE_NOSUB,
 /* 223 */ LEAVE_NOSUB,  /* 224 */ LEAVE_NOSUB,  /* 225 */ LEAVE_NOSUB,
 /* 226 */ LEAVE_NOSUB,  /* 227 */ LEAVE_NOSUB,  /* 228 */ LEAVE_NOSUB,
 /* 229 */ LEAVE_NOSUB,  /* 230 */ LEAVE_NOSUB,  /* 231 */ LEAVE_NOSUB,
 /* 232 */ LEAVE_NOSUB,  /* 233 */ LEAVE_NOSUB,  /* 234 */ LEAVE_NOSUB,
 /* 235 */ KEYWORD_SUB,  /* 236 */ LEAVE_NOSUB,  /* 237 */ KEYWORD_SUB,
 /* 238 */ LEAVE_NOSUB,  /* 239 */ LEAVE_NOSUB,  /* 240 */ LEAVE_NOSUB,
 /* 241 */ LEAVE_NOSUB,  /* 242 */ LEAVE_NOSUB,  /* 243 */ LEAVE_NOSUB,
 /* 244 */ ABREV___SUB,  /* 245 */ LEAVE_NOSUB,  /* 246 */ ABREV___SUB,
 /* 247 */ LEAVE_NOSUB,  /* 248 */ LEAVE___SUB,  /* 249 */ KEYWORD_SUB,
 /* 250 */ LEAVE_NOSUB,  /* 251 */ LEAVE_NOSUB,  /* 252 */ KEYWORD_SUB,
 /* 253 */ LEAVE_NOSUB,  /* 254 */ LEAVE_NOSUB,  /* 255 */ LEAVE_NOSUB,
 /* 256 */ LEAVE_NOSUB,  /* 257 */ LEAVE_NOSUB,  /* 258 */ LEAVE_NOSUB,
 /* 259 */ LEAVE_NOSUB,  /* 260 */ LEAVE_NOSUB,  /* 261 */ LEAVE_NOSUB,
1/* 262 */ KEYWORD_SUB,  /* 263 */ LEAVE_NOSUB,  /* 264 */ LEAVE_NOSUB,
 /* 265 */ LEAVE_NOSUB,  /* 266 */ LEAVE_NOSUB,  /* 267 */ LEAVE_NOSUB,
 /* 268 */ LEAVE_NOSUB,  /* 269 */ LEAVE_NOSUB,  /* 270 */ LEAVE_NOSUB,
 /* 271 */ LEAVE_NOSUB,  /* 272 */ LEAVE_NOSUB,  /* 273 */ LEAVE_NOSUB,
 /* 274 */ LEAVE_NOSUB,  /* 275 */ LEAVE_NOSUB,  /* 276 */ LEAVE_NOSUB,
 /* 277 */ LEAVE_NOSUB,  /* 278 */ LEAVE_NOSUB,  /* 279 */ LEAVE_NOSUB,
 /* 280 */ LEAVE_NOSUB,  /* 281 */ LEAVE_NOSUB,  /* 282 */ KEYWORD_SUB,
 /* 283 */ LEAVE_NOSUB,  /* 284 */ LEAVE_NOSUB,  /* 285 */ LEAVE_NOSUB,
 /* 286 */ LEAVE_NOSUB,  /* 287 */ LEAVE_NOSUB,  /* 288 */ LEAVE_NOSUB,
 /* 289 */ LEAVE_NOSUB,  /* 290 */ LEAVE_NOSUB,  /* 291 */ LEAVE_NOSUB,
 /* 292 */ LEAVE_NOSUB,  /* 293 */ LEAVE_NOSUB,  /* 294 */ LEAVE_NOSUB,
 /* 295 */ LEAVE_NOSUB,  /* 296 */ LEAVE_NOSUB,  /* 297 */ LEAVE_NOSUB,
 /* 298 */ KEYWORD_SUB,  /* 299 */ LEAVE_NOSUB,  /* 300 */ LEAVE_NOSUB,
 /* 301 */ KEYWORD_SUB,  /* 302 */ KEYWORD_SUB,  /* 303 */ KEYWORD_SUB,
 /* 304 */ LEAVE_NOSUB,  /* 305 */ LEAVE_NOSUB,  /* 306 */ LEAVE_NOSUB,
 /* 307 */ LEAVE_NOSUB,  /* 308 */ LEAVE_NOSUB,  /* 309 */ LEAVE_NOSUB,
 /* 310 */ LEAVE_NOSUB,  /* 311 */ LEAVE_NOSUB,  /* 312 */ LEAVE_NOSUB,
 /* 313 */ LEAVE_NOSUB,  /* 314 */ LEAVE_NOSUB,  /* 315 */ LEAVE_NOSUB,
 /* 316 */ LEAVE_NOSUB,  /* 317 */ LEAVE_NOSUB,  /* 318 */ LEAVE_NOSUB,
 /* 319 */ LEAVE_NOSUB,  /* 320 */ LEAVE_NOSUB,  /* 321 */ LEAVE_NOSUB,
 /* 322 */ LEAVE_NOSUB,  /* 323 */ LEAVE_NOSUB,  /* 324 */ LEAVE_NOSUB,
 /* 325 */ KEYWORD_SUB,  /* 326 */ KEYWORD_SUB,  /* 327 */ KEYWORD_SUB,
 /* 328 */ KEYWORD_SUB,  /* 329 */ LEAVE_NOSUB,  /* 330 */ LEAVE_NOSUB,
 /* 331 */ LEAVE_NOSUB,  /* 332 */ LEAVE_NOSUB,  /* 333 */ LEAVE_NOSUB,
 /* 334 */ LEAVE_NOSUB,  /* 335 */ LEAVE_NOSUB,  /* 336 */ KEYWD_NOSUB,
 /* 337 */ LEAVE_NOSUB,  /* 338 */ LEAVE_NOSUB,  /* 339 */ LEAVE_NOSUB,
 /* 340 */ LEAVE_NOSUB,  /* 341 */ LEAVE_NOSUB,  /* 342 */ LEAVE_NOSUB,
 /* 343 */ LEAVE_NOSUB,  /* 344 */ LEAVE_NOSUB,  /* 345 */ LEAVE_NOSUB,
 /* 346 */ LEAVE_NOSUB,  /* 347 */ KEYWORD_SUB,  /* 348 */ ABREV_NOSUB,
 /* 349 */ ABREV_NOSUB,  /* 350 */ ABREV_NOSUB,  /* 351 */ ABREV_NOSUB,
 /* 352 */ ABREV_NOSUB,  /* 353 */ ABREV_NOSUB,  /* 354 */ ABREV_NOSUB,
 /* 355 */ ABREV_NOSUB,  /* 356 */ ABREV_NOSUB,  /* 357 */ LEAVE_NOSUB,
 /* 358 */ LEAVE_NOSUB,  /* 359 */ LEAVE_NOSUB,  /* 360 */ LEAVE_NOSUB,
 /* 361 */ LEAVE_NOSUB,  /* 362 */ LEAVE_NOSUB,  /* 363 */ LEAVE_NOSUB,
 /* 364 */ LEAVE_NOSUB,  /* 365 */ LEAVE_NOSUB);
1DECLARE
   1  SPACING(0:TABLE_HIGH)  STATIC,
      2  MARGIN,
         3  NO_SPACE  BIT(1) INIT(
            /*   0 */  NO_WAY,
            /*   1 */  NO_WAY,  /*   2 */  NO_WAY,  /*   3 */  YES_DO,
            /*   4 */  NO_WAY,  /*   5 */  NO_WAY,  /*   6 */  NO_WAY,
            /*   7 */  NO_WAY,  /*   8 */  NO_WAY,  /*   9 */  NO_WAY,
            /*  10 */  YES_DO,  /*  11 */  YES_DO,  /*  12 */  NO_WAY,
            /*  13 */  NO_WAY,  /*  14 */  NO_WAY,  /*  15 */  NO_WAY,
            /*  16 */  NO_WAY,  /*  17 */  NO_WAY,  /*  18 */  NO_WAY,
            /*  19 */  YES_DO,  /*  20 */  NO_WAY,  /*  21 */  NO_WAY,
            /*  22 */  NO_WAY,  /*  23 */  NO_WAY,  /*  24 */  NO_WAY,
            /*  25 */  NO_WAY,  /*  26 */  NO_WAY,  /*  27 */  NO_WAY,
            /*  28 */  NO_WAY,  /*  29 */  NO_WAY,  /*  30 */  NO_WAY,
            /*  31 */  NO_WAY,  /*  32 */  NO_WAY,  /*  33 */  NO_WAY,
            /*  34 */  NO_WAY,  /*  35 */  NO_WAY,  /*  36 */  NO_WAY,
            /*  37 */  NO_WAY,  /*  38 */  NO_WAY,  /*  39 */  NO_WAY,
            /*  40 */  YES_DO,  /*  41 */  NO_WAY,  /*  42 */  NO_WAY,
            /*  43 */  NO_WAY,  /*  44 */  NO_WAY,  /*  45 */  NO_WAY,
            /*  46 */  NO_WAY,  /*  47 */  NO_WAY,  /*  48 */  NO_WAY,
            /*  49 */  NO_WAY,  /*  50 */  NO_WAY,  /*  51 */  NO_WAY,
            /*  52 */  NO_WAY,  /*  53 */  NO_WAY,  /*  54 */  NO_WAY,
            /*  55 */  NO_WAY,  /*  56 */  NO_WAY,  /*  57 */  NO_WAY,
            /*  58 */  NO_WAY,  /*  59 */  NO_WAY,  /*  60 */  NO_WAY,
            /*  61 */  NO_WAY,  /*  62 */  YES_DO,  /*  63 */  NO_WAY,
            /*  64 */  NO_WAY,  /*  65 */  NO_WAY,  /*  66 */  NO_WAY,
            /*  67 */  NO_WAY,  /*  68 */  NO_WAY,  /*  69 */  NO_WAY,
            /*  70 */  NO_WAY,  /*  71 */  NO_WAY,  /*  72 */  NO_WAY,
            /*  73 */  NO_WAY,  /*  74 */  NO_WAY,  /*  75 */  NO_WAY,
            /*  76 */  NO_WAY,  /*  77 */  NO_WAY,  /*  78 */  NO_WAY,
            /*  79 */  NO_WAY,  /*  80 */  NO_WAY,  /*  81 */  NO_WAY,
            /*  82 */  NO_WAY,  /*  83 */  NO_WAY,  /*  84 */  NO_WAY,
            /*  85 */  NO_WAY,  /*  86 */  NO_WAY,  /*  87 */  NO_WAY,
            /*  88 */  NO_WAY,  /*  89 */  NO_WAY,  /*  90 */  NO_WAY,
            /*  91 */  NO_WAY,  /*  92 */  NO_WAY,  /*  93 */  NO_WAY,
            /*  94 */  NO_WAY,  /*  95 */  NO_WAY,  /*  96 */  NO_WAY,
            /*  97 */  NO_WAY,  /*  98 */  NO_WAY,  /*  99 */  NO_WAY,
            /* 100 */  NO_WAY,  /* 101 */  NO_WAY,  /* 102 */  NO_WAY,
            /* 103 */  NO_WAY,  /* 104 */  NO_WAY,  /* 105 */  NO_WAY,
            /* 106 */  NO_WAY,  /* 107 */  NO_WAY,  /* 108 */  NO_WAY,
            /* 109 */  NO_WAY,  /* 110 */  NO_WAY,  /* 111 */  NO_WAY,
            /* 112 */  NO_WAY,  /* 113 */  NO_WAY,  /* 114 */  NO_WAY,
            /* 115 */  NO_WAY,  /* 116 */  NO_WAY,  /* 117 */  NO_WAY,
1           /* 118 */  NO_WAY,  /* 119 */  NO_WAY,  /* 120 */  NO_WAY,
            /* 121 */  NO_WAY,  /* 122 */  NO_WAY,  /* 123 */  NO_WAY,
            /* 124 */  NO_WAY,  /* 125 */  NO_WAY,  /* 126 */  NO_WAY,
            /* 127 */  NO_WAY,  /* 128 */  NO_WAY,  /* 129 */  NO_WAY,
            /* 130 */  NO_WAY,  /* 131 */  NO_WAY,  /* 132 */  NO_WAY,
            /* 133 */  NO_WAY,  /* 134 */  NO_WAY,  /* 135 */  NO_WAY,
            /* 136 */  NO_WAY,  /* 137 */  NO_WAY,  /* 138 */  NO_WAY,
            /* 139 */  NO_WAY,  /* 140 */  NO_WAY,  /* 141 */  NO_WAY,
            /* 142 */  NO_WAY,  /* 143 */  NO_WAY,  /* 144 */  NO_WAY,
            /* 145 */  NO_WAY,  /* 146 */  NO_WAY,  /* 147 */  NO_WAY,
            /* 148 */  NO_WAY,  /* 149 */  NO_WAY,  /* 150 */  NO_WAY,
            /* 151 */  NO_WAY,  /* 152 */  NO_WAY,  /* 153 */  NO_WAY,
            /* 154 */  NO_WAY,  /* 155 */  NO_WAY,  /* 156 */  NO_WAY,
            /* 157 */  NO_WAY,  /* 158 */  NO_WAY,  /* 159 */  NO_WAY,
            /* 160 */  NO_WAY,  /* 161 */  NO_WAY,  /* 162 */  NO_WAY,
            /* 163 */  NO_WAY,  /* 164 */  NO_WAY,  /* 165 */  NO_WAY,
            /* 166 */  NO_WAY,  /* 167 */  NO_WAY,  /* 168 */  NO_WAY,
            /* 169 */  NO_WAY,  /* 170 */  NO_WAY,  /* 171 */  NO_WAY,
            /* 172 */  NO_WAY,  /* 173 */  NO_WAY,  /* 174 */  NO_WAY,
            /* 175 */  NO_WAY,  /* 176 */  NO_WAY,  /* 177 */  NO_WAY,
            /* 178 */  NO_WAY,  /* 179 */  NO_WAY,  /* 180 */  NO_WAY,
            /* 181 */  NO_WAY,  /* 182 */  NO_WAY,  /* 183 */  NO_WAY,
            /* 184 */  NO_WAY,  /* 185 */  NO_WAY,  /* 186 */  NO_WAY,
            /* 187 */  NO_WAY,  /* 188 */  NO_WAY,  /* 189 */  NO_WAY,
            /* 190 */  NO_WAY,  /* 191 */  NO_WAY,  /* 192 */  NO_WAY,
            /* 193 */  NO_WAY,  /* 194 */  NO_WAY,  /* 195 */  NO_WAY,
            /* 196 */  NO_WAY,  /* 197 */  NO_WAY,  /* 198 */  NO_WAY,
            /* 199 */  NO_WAY,  /* 200 */  NO_WAY,  /* 201 */  NO_WAY,
            /* 202 */  NO_WAY,  /* 203 */  NO_WAY,  /* 204 */  NO_WAY,
            /* 205 */  NO_WAY,  /* 206 */  NO_WAY,  /* 207 */  NO_WAY,
            /* 208 */  NO_WAY,  /* 209 */  NO_WAY,  /* 210 */  NO_WAY,
            /* 211 */  NO_WAY,  /* 212 */  NO_WAY,  /* 213 */  NO_WAY,
            /* 214 */  NO_WAY,  /* 215 */  NO_WAY,  /* 216 */  NO_WAY,
            /* 217 */  NO_WAY,  /* 218 */  NO_WAY,  /* 219 */  NO_WAY,
            /* 220 */  NO_WAY,  /* 221 */  NO_WAY,  /* 222 */  NO_WAY,
            /* 223 */  NO_WAY,  /* 224 */  NO_WAY,  /* 225 */  NO_WAY,
            /* 226 */  NO_WAY,  /* 227 */  NO_WAY,  /* 228 */  NO_WAY,
            /* 229 */  NO_WAY,  /* 230 */  NO_WAY,  /* 231 */  NO_WAY,
            /* 232 */  NO_WAY,  /* 233 */  NO_WAY,  /* 234 */  NO_WAY,
            /* 235 */  NO_WAY,  /* 236 */  NO_WAY,  /* 237 */  NO_WAY,
            /* 238 */  NO_WAY,  /* 239 */  NO_WAY,  /* 240 */  NO_WAY,
            /* 241 */  NO_WAY,  /* 242 */  NO_WAY,  /* 243 */  NO_WAY,
            /* 244 */  NO_WAY,  /* 245 */  NO_WAY,  /* 246 */  NO_WAY,
            /* 247 */  NO_WAY,  /* 248 */  NO_WAY,  /* 249 */  NO_WAY,
1           /* 250 */  NO_WAY,  /* 251 */  NO_WAY,  /* 252 */  NO_WAY,
            /* 253 */  NO_WAY,  /* 254 */  NO_WAY,  /* 255 */  NO_WAY,
            /* 256 */  NO_WAY,  /* 257 */  NO_WAY,  /* 258 */  NO_WAY,
            /* 259 */  NO_WAY,  /* 260 */  NO_WAY,  /* 261 */  NO_WAY,
            /* 262 */  NO_WAY,  /* 263 */  NO_WAY,  /* 264 */  NO_WAY,
            /* 265 */  NO_WAY,  /* 266 */  NO_WAY,  /* 267 */  NO_WAY,
            /* 268 */  NO_WAY,  /* 269 */  NO_WAY,  /* 270 */  NO_WAY,
            /* 271 */  NO_WAY,  /* 272 */  NO_WAY,  /* 273 */  NO_WAY,
            /* 274 */  NO_WAY,  /* 275 */  NO_WAY,  /* 276 */  NO_WAY,
            /* 277 */  NO_WAY,  /* 278 */  NO_WAY,  /* 279 */  NO_WAY,
            /* 280 */  NO_WAY,  /* 281 */  NO_WAY,  /* 282 */  NO_WAY,
            /* 283 */  NO_WAY,  /* 284 */  NO_WAY,  /* 285 */  NO_WAY,
            /* 286 */  NO_WAY,  /* 287 */  NO_WAY,  /* 288 */  NO_WAY,
            /* 289 */  NO_WAY,  /* 290 */  NO_WAY,  /* 291 */  NO_WAY,
            /* 292 */  NO_WAY,  /* 293 */  NO_WAY,  /* 294 */  NO_WAY,
            /* 295 */  NO_WAY,  /* 296 */  NO_WAY,  /* 297 */  NO_WAY,
            /* 298 */  NO_WAY,  /* 299 */  NO_WAY,  /* 300 */  NO_WAY,
            /* 301 */  NO_WAY,  /* 302 */  NO_WAY,  /* 303 */  NO_WAY,
            /* 304 */  NO_WAY,  /* 305 */  NO_WAY,  /* 306 */  NO_WAY,
            /* 307 */  NO_WAY,  /* 308 */  NO_WAY,  /* 309 */  NO_WAY,
            /* 310 */  NO_WAY,  /* 311 */  NO_WAY,  /* 312 */  NO_WAY,
            /* 313 */  NO_WAY,  /* 314 */  NO_WAY,  /* 315 */  NO_WAY,
            /* 316 */  NO_WAY,  /* 317 */  NO_WAY,  /* 318 */  NO_WAY,
            /* 319 */  NO_WAY,  /* 320 */  NO_WAY,  /* 321 */  NO_WAY,
            /* 322 */  NO_WAY,  /* 323 */  NO_WAY,  /* 324 */  NO_WAY,
            /* 325 */  NO_WAY,  /* 326 */  NO_WAY,  /* 327 */  NO_WAY,
            /* 328 */  NO_WAY,  /* 329 */  NO_WAY,  /* 330 */  NO_WAY,
            /* 331 */  NO_WAY,  /* 332 */  NO_WAY,  /* 333 */  NO_WAY,
            /* 334 */  NO_WAY,  /* 335 */  NO_WAY,  /* 336 */  NO_WAY,
            /* 337 */  NO_WAY,  /* 338 */  NO_WAY,  /* 339 */  NO_WAY,
            /* 340 */  NO_WAY,  /* 341 */  NO_WAY,  /* 342 */  NO_WAY,
            /* 343 */  NO_WAY,  /* 344 */  NO_WAY,  /* 345 */  NO_WAY,
            /* 346 */  NO_WAY,  /* 347 */  NO_WAY,  /* 348 */  NO_WAY,
            /* 349 */  NO_WAY,  /* 350 */  NO_WAY,  /* 351 */  NO_WAY,
            /* 352 */  NO_WAY,  /* 353 */  NO_WAY,  /* 354 */  NO_WAY,
            /* 355 */  NO_WAY,  /* 356 */  NO_WAY,  /* 357 */  NO_WAY,
            /* 358 */  NO_WAY,  /* 359 */  NO_WAY,  /* 360 */  NO_WAY,
            /* 361 */  NO_WAY,  /* 362 */  NO_WAY,  /* 363 */  NO_WAY,
            /* 364 */  NO_WAY,  /* 365 */  NO_WAY),
1        3  SPACE_ONCE  BIT(1) INIT(
            /*   0 */  YES_DO,
            /*   1 */  YES_DO,  /*   2 */  YES_DO,  /*   3 */  NO_WAY,
            /*   4 */  YES_DO,  /*   5 */  YES_DO,  /*   6 */  YES_DO,
            /*   7 */  YES_DO,  /*   8 */  YES_DO,  /*   9 */  YES_DO,
            /*  10 */  NO_WAY,  /*  11 */  NO_WAY,  /*  12 */  YES_DO,
            /*  13 */  YES_DO,  /*  14 */  YES_DO,  /*  15 */  YES_DO,
            /*  16 */  YES_DO,  /*  17 */  YES_DO,  /*  18 */  YES_DO,
            /*  19 */  NO_WAY,  /*  20 */  YES_DO,  /*  21 */  YES_DO,
            /*  22 */  YES_DO,  /*  23 */  YES_DO,  /*  24 */  YES_DO,
            /*  25 */  YES_DO,  /*  26 */  YES_DO,  /*  27 */  YES_DO,
            /*  28 */  YES_DO,  /*  29 */  YES_DO,  /*  30 */  YES_DO,
            /*  31 */  YES_DO,  /*  32 */  YES_DO,  /*  33 */  YES_DO,
            /*  34 */  YES_DO,  /*  35 */  YES_DO,  /*  36 */  YES_DO,
            /*  37 */  YES_DO,  /*  38 */  YES_DO,  /*  39 */  YES_DO,
            /*  40 */  NO_WAY,  /*  41 */  YES_DO,  /*  42 */  YES_DO,
            /*  43 */  YES_DO,  /*  44 */  YES_DO,  /*  45 */  YES_DO,
            /*  46 */  YES_DO,  /*  47 */  YES_DO,  /*  48 */  YES_DO,
            /*  49 */  YES_DO,  /*  50 */  YES_DO,  /*  51 */  YES_DO,
            /*  52 */  YES_DO,  /*  53 */  YES_DO,  /*  54 */  YES_DO,
            /*  55 */  YES_DO,  /*  56 */  YES_DO,  /*  57 */  YES_DO,
            /*  58 */  YES_DO,  /*  59 */  YES_DO,  /*  60 */  YES_DO,
            /*  61 */  YES_DO,  /*  62 */  NO_WAY,  /*  63 */  YES_DO,
            /*  64 */  NO_WAY,  /*  65 */  NO_WAY,  /*  66 */  YES_DO,
            /*  67 */  NO_WAY,  /*  68 */  YES_DO,  /*  69 */  YES_DO,
            /*  70 */  YES_DO,  /*  71 */  YES_DO,  /*  72 */  YES_DO,
            /*  73 */  YES_DO,  /*  74 */  YES_DO,  /*  75 */  YES_DO,
            /*  76 */  YES_DO,  /*  77 */  NO_WAY,  /*  78 */  YES_DO,
            /*  79 */  YES_DO,  /*  80 */  YES_DO,  /*  81 */  YES_DO,
            /*  82 */  YES_DO,  /*  83 */  NO_WAY,  /*  84 */  NO_WAY,
            /*  85 */  YES_DO,  /*  86 */  YES_DO,  /*  87 */  YES_DO,
            /*  88 */  YES_DO,  /*  89 */  YES_DO,  /*  90 */  YES_DO,
            /*  91 */  YES_DO,  /*  92 */  YES_DO,  /*  93 */  YES_DO,
            /*  94 */  YES_DO,  /*  95 */  YES_DO,  /*  96 */  YES_DO,
            /*  97 */  YES_DO,  /*  98 */  YES_DO,  /*  99 */  YES_DO,
            /* 100 */  YES_DO,  /* 101 */  YES_DO,  /* 102 */  YES_DO,
            /* 103 */  YES_DO,  /* 104 */  YES_DO,  /* 105 */  YES_DO,
            /* 106 */  YES_DO,  /* 107 */  YES_DO,  /* 108 */  YES_DO,
            /* 109 */  YES_DO,  /* 110 */  YES_DO,  /* 111 */  YES_DO,
            /* 112 */  YES_DO,  /* 113 */  YES_DO,  /* 114 */  YES_DO,
            /* 115 */  NO_WAY,  /* 116 */  YES_DO,  /* 117 */  YES_DO,
            /* 118 */  YES_DO,  /* 119 */  YES_DO,  /* 120 */  YES_DO,
            /* 121 */  YES_DO,  /* 122 */  YES_DO,  /* 123 */  YES_DO,
            /* 124 */  YES_DO,  /* 125 */  YES_DO,  /* 126 */  YES_DO,
1           /* 127 */  YES_DO,  /* 128 */  YES_DO,  /* 129 */  YES_DO,
            /* 130 */  YES_DO,  /* 131 */  NO_WAY,  /* 132 */  YES_DO,
            /* 133 */  YES_DO,  /* 134 */  YES_DO,  /* 135 */  YES_DO,
            /* 136 */  YES_DO,  /* 137 */  YES_DO,  /* 138 */  YES_DO,
            /* 139 */  YES_DO,  /* 140 */  YES_DO,  /* 141 */  YES_DO,
            /* 142 */  YES_DO,  /* 143 */  YES_DO,  /* 144 */  YES_DO,
            /* 145 */  YES_DO,  /* 146 */  YES_DO,  /* 147 */  NO_WAY,
            /* 148 */  YES_DO,  /* 149 */  NO_WAY,  /* 150 */  YES_DO,
            /* 151 */  YES_DO,  /* 152 */  YES_DO,  /* 153 */  YES_DO,
            /* 154 */  YES_DO,  /* 155 */  YES_DO,  /* 156 */  YES_DO,
            /* 157 */  YES_DO,  /* 158 */  YES_DO,  /* 159 */  YES_DO,
            /* 160 */  YES_DO,  /* 161 */  YES_DO,  /* 162 */  YES_DO,
            /* 163 */  YES_DO,  /* 164 */  YES_DO,  /* 165 */  YES_DO,
            /* 166 */  YES_DO,  /* 167 */  YES_DO,  /* 168 */  YES_DO,
            /* 169 */  YES_DO,  /* 170 */  YES_DO,  /* 171 */  YES_DO,
            /* 172 */  YES_DO,  /* 173 */  YES_DO,  /* 174 */  YES_DO,
            /* 175 */  YES_DO,  /* 176 */  YES_DO,  /* 177 */  YES_DO,
            /* 178 */  YES_DO,  /* 179 */  YES_DO,  /* 180 */  YES_DO,
            /* 181 */  YES_DO,  /* 182 */  YES_DO,  /* 183 */  YES_DO,
            /* 184 */  YES_DO,  /* 185 */  YES_DO,  /* 186 */  YES_DO,
            /* 187 */  NO_WAY,  /* 188 */  YES_DO,  /* 189 */  YES_DO,
            /* 190 */  YES_DO,  /* 191 */  YES_DO,  /* 192 */  YES_DO,
            /* 193 */  YES_DO,  /* 194 */  YES_DO,  /* 195 */  YES_DO,
            /* 196 */  YES_DO,  /* 197 */  YES_DO,  /* 198 */  YES_DO,
            /* 199 */  YES_DO,  /* 200 */  YES_DO,  /* 201 */  YES_DO,
            /* 202 */  YES_DO,  /* 203 */  YES_DO,  /* 204 */  YES_DO,
            /* 205 */  YES_DO,  /* 206 */  YES_DO,  /* 207 */  YES_DO,
            /* 208 */  YES_DO,  /* 209 */  YES_DO,  /* 210 */  YES_DO,
            /* 211 */  YES_DO,  /* 212 */  YES_DO,  /* 213 */  YES_DO,
            /* 214 */  YES_DO,  /* 215 */  YES_DO,  /* 216 */  YES_DO,
            /* 217 */  YES_DO,  /* 218 */  YES_DO,  /* 219 */  YES_DO,
            /* 220 */  YES_DO,  /* 221 */  YES_DO,  /* 222 */  YES_DO,
            /* 223 */  YES_DO,  /* 224 */  YES_DO,  /* 225 */  YES_DO,
            /* 226 */  YES_DO,  /* 227 */  YES_DO,  /* 228 */  YES_DO,
            /* 229 */  YES_DO,  /* 230 */  YES_DO,  /* 231 */  YES_DO,
            /* 232 */  YES_DO,  /* 233 */  YES_DO,  /* 234 */  YES_DO,
            /* 235 */  YES_DO,  /* 236 */  YES_DO,  /* 237 */  YES_DO,
            /* 238 */  YES_DO,  /* 239 */  YES_DO,  /* 240 */  YES_DO,
            /* 241 */  YES_DO,  /* 242 */  YES_DO,  /* 243 */  YES_DO,
            /* 244 */  NO_WAY,  /* 245 */  YES_DO,  /* 246 */  NO_WAY,
            /* 247 */  YES_DO,  /* 248 */  YES_DO,  /* 249 */  YES_DO,
            /* 250 */  YES_DO,  /* 251 */  YES_DO,  /* 252 */  YES_DO,
            /* 253 */  YES_DO,  /* 254 */  YES_DO,  /* 255 */  YES_DO,
            /* 256 */  YES_DO,  /* 257 */  YES_DO,  /* 258 */  YES_DO,
1           /* 259 */  YES_DO,  /* 260 */  YES_DO,  /* 261 */  YES_DO,
            /* 262 */  YES_DO,  /* 263 */  YES_DO,  /* 264 */  YES_DO,
            /* 265 */  YES_DO,  /* 266 */  YES_DO,  /* 267 */  YES_DO,
            /* 268 */  YES_DO,  /* 269 */  YES_DO,  /* 270 */  YES_DO,
            /* 271 */  YES_DO,  /* 272 */  YES_DO,  /* 273 */  YES_DO,
            /* 274 */  YES_DO,  /* 275 */  YES_DO,  /* 276 */  YES_DO,
            /* 277 */  YES_DO,  /* 278 */  YES_DO,  /* 279 */  YES_DO,
            /* 280 */  YES_DO,  /* 281 */  YES_DO,  /* 282 */  YES_DO,
            /* 283 */  YES_DO,  /* 284 */  YES_DO,  /* 285 */  YES_DO,
            /* 286 */  YES_DO,  /* 287 */  YES_DO,  /* 288 */  YES_DO,
            /* 289 */  YES_DO,  /* 290 */  YES_DO,  /* 291 */  YES_DO,
            /* 292 */  YES_DO,  /* 293 */  YES_DO,  /* 294 */  YES_DO,
            /* 295 */  YES_DO,  /* 296 */  YES_DO,  /* 297 */  YES_DO,
            /* 298 */  YES_DO,  /* 299 */  YES_DO,  /* 300 */  YES_DO,
            /* 301 */  YES_DO,  /* 302 */  YES_DO,  /* 303 */  YES_DO,
            /* 304 */  YES_DO,  /* 305 */  YES_DO,  /* 306 */  YES_DO,
            /* 307 */  YES_DO,  /* 308 */  YES_DO,  /* 309 */  YES_DO,
            /* 310 */  YES_DO,  /* 311 */  YES_DO,  /* 312 */  YES_DO,
            /* 313 */  YES_DO,  /* 314 */  YES_DO,  /* 315 */  YES_DO,
            /* 316 */  YES_DO,  /* 317 */  YES_DO,  /* 318 */  YES_DO,
            /* 319 */  YES_DO,  /* 320 */  YES_DO,  /* 321 */  YES_DO,
            /* 322 */  YES_DO,  /* 323 */  YES_DO,  /* 324 */  YES_DO,
            /* 325 */  YES_DO,  /* 326 */  YES_DO,  /* 327 */  YES_DO,
            /* 328 */  YES_DO,  /* 329 */  YES_DO,  /* 330 */  YES_DO,
            /* 331 */  YES_DO,  /* 332 */  YES_DO,  /* 333 */  YES_DO,
            /* 334 */  YES_DO,  /* 335 */  YES_DO,  /* 336 */  YES_DO,
            /* 337 */  YES_DO,  /* 338 */  YES_DO,  /* 339 */  YES_DO,
            /* 340 */  YES_DO,  /* 341 */  YES_DO,  /* 342 */  YES_DO,
            /* 343 */  YES_DO,  /* 344 */  YES_DO,  /* 345 */  YES_DO,
            /* 346 */  YES_DO,  /* 347 */  YES_DO,  /* 348 */  YES_DO,
            /* 349 */  YES_DO,  /* 350 */  YES_DO,  /* 351 */  YES_DO,
            /* 352 */  YES_DO,  /* 353 */  YES_DO,  /* 354 */  YES_DO,
            /* 355 */  YES_DO,  /* 356 */  YES_DO,  /* 357 */  YES_DO,
            /* 358 */  YES_DO,  /* 359 */  YES_DO,  /* 360 */  YES_DO,
            /* 361 */  YES_DO,  /* 362 */  YES_DO,  /* 363 */  YES_DO,
            /* 364 */  YES_DO,  /* 365 */  YES_DO),
1        3  SPACE_TWICE  BIT(1) INIT(
            /*   0 */  NO_WAY,
            /*   1 */  NO_WAY,  /*   2 */  NO_WAY,  /*   3 */  NO_WAY,
            /*   4 */  NO_WAY,  /*   5 */  NO_WAY,  /*   6 */  NO_WAY,
            /*   7 */  NO_WAY,  /*   8 */  NO_WAY,  /*   9 */  NO_WAY,
            /*  10 */  NO_WAY,  /*  11 */  NO_WAY,  /*  12 */  NO_WAY,
            /*  13 */  NO_WAY,  /*  14 */  NO_WAY,  /*  15 */  NO_WAY,
            /*  16 */  NO_WAY,  /*  17 */  NO_WAY,  /*  18 */  NO_WAY,
            /*  19 */  NO_WAY,  /*  20 */  NO_WAY,  /*  21 */  NO_WAY,
            /*  22 */  NO_WAY,  /*  23 */  NO_WAY,  /*  24 */  NO_WAY,
            /*  25 */  NO_WAY,  /*  26 */  NO_WAY,  /*  27 */  NO_WAY,
            /*  28 */  NO_WAY,  /*  29 */  NO_WAY,  /*  30 */  NO_WAY,
            /*  31 */  NO_WAY,  /*  32 */  NO_WAY,  /*  33 */  NO_WAY,
            /*  34 */  NO_WAY,  /*  35 */  NO_WAY,  /*  36 */  NO_WAY,
            /*  37 */  NO_WAY,  /*  38 */  NO_WAY,  /*  39 */  NO_WAY,
            /*  40 */  NO_WAY,  /*  41 */  NO_WAY,  /*  42 */  NO_WAY,
            /*  43 */  NO_WAY,  /*  44 */  NO_WAY,  /*  45 */  NO_WAY,
            /*  46 */  NO_WAY,  /*  47 */  NO_WAY,  /*  48 */  NO_WAY,
            /*  49 */  NO_WAY,  /*  50 */  NO_WAY,  /*  51 */  NO_WAY,
            /*  52 */  NO_WAY,  /*  53 */  NO_WAY,  /*  54 */  NO_WAY,
            /*  55 */  NO_WAY,  /*  56 */  NO_WAY,  /*  57 */  NO_WAY,
            /*  58 */  NO_WAY,  /*  59 */  NO_WAY,  /*  60 */  NO_WAY,
            /*  61 */  NO_WAY,  /*  62 */  NO_WAY,  /*  63 */  NO_WAY,
            /*  64 */  YES_DO,  /*  65 */  YES_DO,  /*  66 */  NO_WAY,
            /*  67 */  YES_DO,  /*  68 */  NO_WAY,  /*  69 */  NO_WAY,
            /*  70 */  NO_WAY,  /*  71 */  NO_WAY,  /*  72 */  NO_WAY,
            /*  73 */  NO_WAY,  /*  74 */  NO_WAY,  /*  75 */  NO_WAY,
            /*  76 */  NO_WAY,  /*  77 */  YES_DO,  /*  78 */  NO_WAY,
            /*  79 */  NO_WAY,  /*  80 */  NO_WAY,  /*  81 */  NO_WAY,
            /*  82 */  NO_WAY,  /*  83 */  YES_DO,  /*  84 */  YES_DO,
            /*  85 */  NO_WAY,  /*  86 */  NO_WAY,  /*  87 */  NO_WAY,
            /*  88 */  NO_WAY,  /*  89 */  NO_WAY,  /*  90 */  NO_WAY,
            /*  91 */  NO_WAY,  /*  92 */  NO_WAY,  /*  93 */  NO_WAY,
            /*  94 */  NO_WAY,  /*  95 */  NO_WAY,  /*  96 */  NO_WAY,
            /*  97 */  NO_WAY,  /*  98 */  NO_WAY,  /*  99 */  NO_WAY,
            /* 100 */  NO_WAY,  /* 101 */  NO_WAY,  /* 102 */  NO_WAY,
            /* 103 */  NO_WAY,  /* 104 */  NO_WAY,  /* 105 */  NO_WAY,
            /* 106 */  NO_WAY,  /* 107 */  NO_WAY,  /* 108 */  NO_WAY,
            /* 109 */  NO_WAY,  /* 110 */  NO_WAY,  /* 111 */  NO_WAY,
            /* 112 */  NO_WAY,  /* 113 */  NO_WAY,  /* 114 */  NO_WAY,
            /* 115 */  YES_DO,  /* 116 */  NO_WAY,  /* 117 */  NO_WAY,
            /* 118 */  NO_WAY,  /* 119 */  NO_WAY,  /* 120 */  NO_WAY,
            /* 121 */  NO_WAY,  /* 122 */  NO_WAY,  /* 123 */  NO_WAY,
            /* 124 */  NO_WAY,  /* 125 */  NO_WAY,  /* 126 */  NO_WAY,
1           /* 127 */  NO_WAY,  /* 128 */  NO_WAY,  /* 129 */  NO_WAY,
            /* 130 */  NO_WAY,  /* 131 */  YES_DO,  /* 132 */  NO_WAY,
            /* 133 */  NO_WAY,  /* 134 */  NO_WAY,  /* 135 */  NO_WAY,
            /* 136 */  NO_WAY,  /* 137 */  NO_WAY,  /* 138 */  NO_WAY,
            /* 139 */  NO_WAY,  /* 140 */  NO_WAY,  /* 141 */  NO_WAY,
            /* 142 */  NO_WAY,  /* 143 */  NO_WAY,  /* 144 */  NO_WAY,
            /* 145 */  NO_WAY,  /* 146 */  NO_WAY,  /* 147 */  YES_DO,
            /* 148 */  NO_WAY,  /* 149 */  YES_DO,  /* 150 */  NO_WAY,
            /* 151 */  NO_WAY,  /* 152 */  NO_WAY,  /* 153 */  NO_WAY,
            /* 154 */  NO_WAY,  /* 155 */  NO_WAY,  /* 156 */  NO_WAY,
            /* 157 */  NO_WAY,  /* 158 */  NO_WAY,  /* 159 */  NO_WAY,
            /* 160 */  NO_WAY,  /* 161 */  NO_WAY,  /* 162 */  NO_WAY,
            /* 163 */  NO_WAY,  /* 164 */  NO_WAY,  /* 165 */  NO_WAY,
            /* 166 */  NO_WAY,  /* 167 */  NO_WAY,  /* 168 */  NO_WAY,
            /* 169 */  NO_WAY,  /* 170 */  NO_WAY,  /* 171 */  NO_WAY,
            /* 172 */  NO_WAY,  /* 173 */  NO_WAY,  /* 174 */  NO_WAY,
            /* 175 */  NO_WAY,  /* 176 */  NO_WAY,  /* 177 */  NO_WAY,
            /* 178 */  NO_WAY,  /* 179 */  NO_WAY,  /* 180 */  NO_WAY,
            /* 181 */  NO_WAY,  /* 182 */  NO_WAY,  /* 183 */  NO_WAY,
            /* 184 */  NO_WAY,  /* 185 */  NO_WAY,  /* 186 */  NO_WAY,
            /* 187 */  YES_DO,  /* 188 */  NO_WAY,  /* 189 */  NO_WAY,
            /* 190 */  NO_WAY,  /* 191 */  NO_WAY,  /* 192 */  NO_WAY,
            /* 193 */  NO_WAY,  /* 194 */  NO_WAY,  /* 195 */  NO_WAY,
            /* 196 */  NO_WAY,  /* 197 */  NO_WAY,  /* 198 */  NO_WAY,
            /* 199 */  NO_WAY,  /* 200 */  NO_WAY,  /* 201 */  NO_WAY,
            /* 202 */  NO_WAY,  /* 203 */  NO_WAY,  /* 204 */  NO_WAY,
            /* 205 */  NO_WAY,  /* 206 */  NO_WAY,  /* 207 */  NO_WAY,
            /* 208 */  NO_WAY,  /* 209 */  NO_WAY,  /* 210 */  NO_WAY,
            /* 211 */  NO_WAY,  /* 212 */  NO_WAY,  /* 213 */  NO_WAY,
            /* 214 */  NO_WAY,  /* 215 */  NO_WAY,  /* 216 */  NO_WAY,
            /* 217 */  NO_WAY,  /* 218 */  NO_WAY,  /* 219 */  NO_WAY,
            /* 220 */  NO_WAY,  /* 221 */  NO_WAY,  /* 222 */  NO_WAY,
            /* 223 */  NO_WAY,  /* 224 */  NO_WAY,  /* 225 */  NO_WAY,
            /* 226 */  NO_WAY,  /* 227 */  NO_WAY,  /* 228 */  NO_WAY,
            /* 229 */  NO_WAY,  /* 230 */  NO_WAY,  /* 231 */  NO_WAY,
            /* 232 */  NO_WAY,  /* 233 */  NO_WAY,  /* 234 */  NO_WAY,
            /* 235 */  NO_WAY,  /* 236 */  NO_WAY,  /* 237 */  NO_WAY,
            /* 238 */  NO_WAY,  /* 239 */  NO_WAY,  /* 240 */  NO_WAY,
            /* 241 */  NO_WAY,  /* 242 */  NO_WAY,  /* 243 */  NO_WAY,
            /* 244 */  YES_DO,  /* 245 */  NO_WAY,  /* 246 */  YES_DO,
            /* 247 */  NO_WAY,  /* 248 */  NO_WAY,  /* 249 */  NO_WAY,
            /* 250 */  NO_WAY,  /* 251 */  NO_WAY,  /* 252 */  NO_WAY,
            /* 253 */  NO_WAY,  /* 254 */  NO_WAY,  /* 255 */  NO_WAY,
            /* 256 */  NO_WAY,  /* 257 */  NO_WAY,  /* 258 */  NO_WAY,
1           /* 259 */  NO_WAY,  /* 260 */  NO_WAY,  /* 261 */  NO_WAY,
            /* 262 */  NO_WAY,  /* 263 */  NO_WAY,  /* 264 */  NO_WAY,
            /* 265 */  NO_WAY,  /* 266 */  NO_WAY,  /* 267 */  NO_WAY,
            /* 268 */  NO_WAY,  /* 269 */  NO_WAY,  /* 270 */  NO_WAY,
            /* 271 */  NO_WAY,  /* 272 */  NO_WAY,  /* 273 */  NO_WAY,
            /* 274 */  NO_WAY,  /* 275 */  NO_WAY,  /* 276 */  NO_WAY,
            /* 277 */  NO_WAY,  /* 278 */  NO_WAY,  /* 279 */  NO_WAY,
            /* 280 */  NO_WAY,  /* 281 */  NO_WAY,  /* 282 */  NO_WAY,
            /* 283 */  NO_WAY,  /* 284 */  NO_WAY,  /* 285 */  NO_WAY,
            /* 286 */  NO_WAY,  /* 287 */  NO_WAY,  /* 288 */  NO_WAY,
            /* 289 */  NO_WAY,  /* 290 */  NO_WAY,  /* 291 */  NO_WAY,
            /* 292 */  NO_WAY,  /* 293 */  NO_WAY,  /* 294 */  NO_WAY,
            /* 295 */  NO_WAY,  /* 296 */  NO_WAY,  /* 297 */  NO_WAY,
            /* 298 */  NO_WAY,  /* 299 */  NO_WAY,  /* 300 */  NO_WAY,
            /* 301 */  NO_WAY,  /* 302 */  NO_WAY,  /* 303 */  NO_WAY,
            /* 304 */  NO_WAY,  /* 305 */  NO_WAY,  /* 306 */  NO_WAY,
            /* 307 */  NO_WAY,  /* 308 */  NO_WAY,  /* 309 */  NO_WAY,
            /* 310 */  NO_WAY,  /* 311 */  NO_WAY,  /* 312 */  NO_WAY,
            /* 313 */  NO_WAY,  /* 314 */  NO_WAY,  /* 315 */  NO_WAY,
            /* 316 */  NO_WAY,  /* 317 */  NO_WAY,  /* 318 */  NO_WAY,
            /* 319 */  NO_WAY,  /* 320 */  NO_WAY,  /* 321 */  NO_WAY,
            /* 322 */  NO_WAY,  /* 323 */  NO_WAY,  /* 324 */  NO_WAY,
            /* 325 */  NO_WAY,  /* 326 */  NO_WAY,  /* 327 */  NO_WAY,
            /* 328 */  NO_WAY,  /* 329 */  NO_WAY,  /* 330 */  NO_WAY,
            /* 331 */  NO_WAY,  /* 332 */  NO_WAY,  /* 333 */  NO_WAY,
            /* 334 */  NO_WAY,  /* 335 */  NO_WAY,  /* 336 */  NO_WAY,
            /* 337 */  NO_WAY,  /* 338 */  NO_WAY,  /* 339 */  NO_WAY,
            /* 340 */  NO_WAY,  /* 341 */  NO_WAY,  /* 342 */  NO_WAY,
            /* 343 */  NO_WAY,  /* 344 */  NO_WAY,  /* 345 */  NO_WAY,
            /* 346 */  NO_WAY,  /* 347 */  NO_WAY,  /* 348 */  NO_WAY,
            /* 349 */  NO_WAY,  /* 350 */  NO_WAY,  /* 351 */  NO_WAY,
            /* 352 */  NO_WAY,  /* 353 */  NO_WAY,  /* 354 */  NO_WAY,
            /* 355 */  NO_WAY,  /* 356 */  NO_WAY,  /* 357 */  NO_WAY,
            /* 358 */  NO_WAY,  /* 359 */  NO_WAY,  /* 360 */  NO_WAY,
            /* 361 */  NO_WAY,  /* 362 */  NO_WAY,  /* 363 */  NO_WAY,
            /* 364 */  NO_WAY,  /* 365 */  NO_WAY),
1        3  INDENT_CONSTRUCT BIT(1) INIT(
            /*   0 */  NO_WAY,
            /*   1 */  NO_WAY,  /*   2 */  NO_WAY,  /*   3 */  NO_WAY,
            /*   4 */  NO_WAY,  /*   5 */  NO_WAY,  /*   6 */  NO_WAY,
            /*   7 */  NO_WAY,  /*   8 */  NO_WAY,  /*   9 */  NO_WAY,
            /*  10 */  NO_WAY,  /*  11 */  NO_WAY,  /*  12 */  NO_WAY,
            /*  13 */  NO_WAY,  /*  14 */  NO_WAY,  /*  15 */  NO_WAY,
            /*  16 */  NO_WAY,  /*  17 */  NO_WAY,  /*  18 */  NO_WAY,
            /*  19 */  NO_WAY,  /*  20 */  NO_WAY,  /*  21 */  NO_WAY,
            /*  22 */  NO_WAY,  /*  23 */  NO_WAY,  /*  24 */  YES_DO,
            /*  25 */  YES_DO,  /*  26 */  YES_DO,  /*  27 */  NO_WAY,
            /*  28 */  NO_WAY,  /*  29 */  NO_WAY,  /*  30 */  NO_WAY,
            /*  31 */  NO_WAY,  /*  32 */  NO_WAY,  /*  33 */  NO_WAY,
            /*  34 */  NO_WAY,  /*  35 */  NO_WAY,  /*  36 */  NO_WAY,
            /*  37 */  YES_DO,  /*  38 */  NO_WAY,  /*  39 */  NO_WAY,
            /*  40 */  NO_WAY,  /*  41 */  NO_WAY,  /*  42 */  NO_WAY,
            /*  43 */  NO_WAY,  /*  44 */  NO_WAY,  /*  45 */  NO_WAY,
            /*  46 */  NO_WAY,  /*  47 */  NO_WAY,  /*  48 */  NO_WAY,
            /*  49 */  NO_WAY,  /*  50 */  NO_WAY,  /*  51 */  NO_WAY,
            /*  52 */  NO_WAY,  /*  53 */  NO_WAY,  /*  54 */  NO_WAY,
            /*  55 */  NO_WAY,  /*  56 */  NO_WAY,  /*  57 */  NO_WAY,
            /*  58 */  NO_WAY,  /*  59 */  NO_WAY,  /*  60 */  NO_WAY,
            /*  61 */  NO_WAY,  /*  62 */  NO_WAY,  /*  63 */  NO_WAY,
            /*  64 */  NO_WAY,  /*  65 */  YES_DO,  /*  66 */  NO_WAY,
            /*  67 */  NO_WAY,  /*  68 */  NO_WAY,  /*  69 */  NO_WAY,
            /*  70 */  NO_WAY,  /*  71 */  NO_WAY,  /*  72 */  NO_WAY,
            /*  73 */  NO_WAY,  /*  74 */  NO_WAY,  /*  75 */  NO_WAY,
            /*  76 */  NO_WAY,  /*  77 */  NO_WAY,  /*  78 */  NO_WAY,
            /*  79 */  NO_WAY,  /*  80 */  NO_WAY,  /*  81 */  NO_WAY,
            /*  82 */  NO_WAY,  /*  83 */  NO_WAY,  /*  84 */  NO_WAY,
            /*  85 */  NO_WAY,  /*  86 */  NO_WAY,  /*  87 */  NO_WAY,
            /*  88 */  NO_WAY,  /*  89 */  NO_WAY,  /*  90 */  NO_WAY,
            /*  91 */  NO_WAY,  /*  92 */  NO_WAY,  /*  93 */  NO_WAY,
            /*  94 */  NO_WAY,  /*  95 */  NO_WAY,  /*  96 */  NO_WAY,
            /*  97 */  NO_WAY,  /*  98 */  NO_WAY,  /*  99 */  NO_WAY,
            /* 100 */  NO_WAY,  /* 101 */  NO_WAY,  /* 102 */  NO_WAY,
            /* 103 */  NO_WAY,  /* 104 */  NO_WAY,  /* 105 */  NO_WAY,
            /* 106 */  NO_WAY,  /* 107 */  NO_WAY,  /* 108 */  NO_WAY,
            /* 109 */  NO_WAY,  /* 110 */  NO_WAY,  /* 111 */  NO_WAY,
            /* 112 */  NO_WAY,  /* 113 */  YES_DO,  /* 114 */  NO_WAY,
            /* 115 */  NO_WAY,  /* 116 */  NO_WAY,  /* 117 */  NO_WAY,
            /* 118 */  NO_WAY,  /* 119 */  NO_WAY,  /* 120 */  NO_WAY,
            /* 121 */  NO_WAY,  /* 122 */  NO_WAY,  /* 123 */  YES_DO,
            /* 124 */  NO_WAY,  /* 125 */  NO_WAY,  /* 126 */  YES_DO,
1           /* 127 */  NO_WAY,  /* 128 */  NO_WAY,  /* 129 */  NO_WAY,
            /* 130 */  NO_WAY,  /* 131 */  NO_WAY,  /* 132 */  NO_WAY,
            /* 133 */  NO_WAY,  /* 134 */  NO_WAY,  /* 135 */  NO_WAY,
            /* 136 */  NO_WAY,  /* 137 */  NO_WAY,  /* 138 */  NO_WAY,
            /* 139 */  NO_WAY,  /* 140 */  NO_WAY,  /* 141 */  NO_WAY,
            /* 142 */  NO_WAY,  /* 143 */  NO_WAY,  /* 144 */  NO_WAY,
            /* 145 */  NO_WAY,  /* 146 */  NO_WAY,  /* 147 */  NO_WAY,
            /* 148 */  NO_WAY,  /* 149 */  NO_WAY,  /* 150 */  NO_WAY,
            /* 151 */  NO_WAY,  /* 152 */  NO_WAY,  /* 153 */  NO_WAY,
            /* 154 */  NO_WAY,  /* 155 */  NO_WAY,  /* 156 */  NO_WAY,
            /* 157 */  NO_WAY,  /* 158 */  NO_WAY,  /* 159 */  NO_WAY,
            /* 160 */  NO_WAY,  /* 161 */  NO_WAY,  /* 162 */  NO_WAY,
            /* 163 */  NO_WAY,  /* 164 */  NO_WAY,  /* 165 */  NO_WAY,
            /* 166 */  NO_WAY,  /* 167 */  NO_WAY,  /* 168 */  NO_WAY,
            /* 169 */  NO_WAY,  /* 170 */  NO_WAY,  /* 171 */  NO_WAY,
            /* 172 */  NO_WAY,  /* 173 */  NO_WAY,  /* 174 */  NO_WAY,
            /* 175 */  NO_WAY,  /* 176 */  NO_WAY,  /* 177 */  NO_WAY,
            /* 178 */  NO_WAY,  /* 179 */  NO_WAY,  /* 180 */  NO_WAY,
            /* 181 */  NO_WAY,  /* 182 */  NO_WAY,  /* 183 */  NO_WAY,
            /* 184 */  NO_WAY,  /* 185 */  NO_WAY,  /* 186 */  NO_WAY,
            /* 187 */  NO_WAY,  /* 188 */  NO_WAY,  /* 189 */  NO_WAY,
            /* 190 */  NO_WAY,  /* 191 */  NO_WAY,  /* 192 */  NO_WAY,
            /* 193 */  NO_WAY,  /* 194 */  NO_WAY,  /* 195 */  NO_WAY,
            /* 196 */  NO_WAY,  /* 197 */  NO_WAY,  /* 198 */  NO_WAY,
            /* 199 */  NO_WAY,  /* 200 */  NO_WAY,  /* 201 */  NO_WAY,
            /* 202 */  NO_WAY,  /* 203 */  NO_WAY,  /* 204 */  NO_WAY,
            /* 205 */  NO_WAY,  /* 206 */  NO_WAY,  /* 207 */  NO_WAY,
            /* 208 */  NO_WAY,  /* 209 */  NO_WAY,  /* 210 */  NO_WAY,
            /* 211 */  NO_WAY,  /* 212 */  NO_WAY,  /* 213 */  NO_WAY,
            /* 214 */  NO_WAY,  /* 215 */  NO_WAY,  /* 216 */  NO_WAY,
            /* 217 */  NO_WAY,  /* 218 */  NO_WAY,  /* 219 */  NO_WAY,
            /* 220 */  NO_WAY,  /* 221 */  NO_WAY,  /* 222 */  NO_WAY,
            /* 223 */  NO_WAY,  /* 224 */  NO_WAY,  /* 225 */  NO_WAY,
            /* 226 */  NO_WAY,  /* 227 */  NO_WAY,  /* 228 */  NO_WAY,
            /* 229 */  NO_WAY,  /* 230 */  NO_WAY,  /* 231 */  NO_WAY,
            /* 232 */  NO_WAY,  /* 233 */  NO_WAY,  /* 234 */  NO_WAY,
            /* 235 */  NO_WAY,  /* 236 */  NO_WAY,  /* 237 */  NO_WAY,
            /* 238 */  NO_WAY,  /* 239 */  NO_WAY,  /* 240 */  NO_WAY,
            /* 241 */  NO_WAY,  /* 242 */  NO_WAY,  /* 243 */  NO_WAY,
            /* 244 */  NO_WAY,  /* 245 */  NO_WAY,  /* 246 */  NO_WAY,
            /* 247 */  NO_WAY,  /* 248 */  NO_WAY,  /* 249 */  NO_WAY,
            /* 250 */  NO_WAY,  /* 251 */  NO_WAY,  /* 252 */  NO_WAY,
            /* 253 */  NO_WAY,  /* 254 */  NO_WAY,  /* 255 */  NO_WAY,
            /* 256 */  NO_WAY,  /* 257 */  NO_WAY,  /* 258 */  NO_WAY,
1           /* 259 */  NO_WAY,  /* 260 */  NO_WAY,  /* 261 */  NO_WAY,
            /* 262 */  NO_WAY,  /* 263 */  NO_WAY,  /* 264 */  NO_WAY,
            /* 265 */  NO_WAY,  /* 266 */  NO_WAY,  /* 267 */  NO_WAY,
            /* 268 */  NO_WAY,  /* 269 */  NO_WAY,  /* 270 */  NO_WAY,
            /* 271 */  NO_WAY,  /* 272 */  NO_WAY,  /* 273 */  NO_WAY,
            /* 274 */  NO_WAY,  /* 275 */  NO_WAY,  /* 276 */  NO_WAY,
            /* 277 */  NO_WAY,  /* 278 */  NO_WAY,  /* 279 */  NO_WAY,
            /* 280 */  NO_WAY,  /* 281 */  YES_DO,  /* 282 */  NO_WAY,
            /* 283 */  NO_WAY,  /* 284 */  NO_WAY,  /* 285 */  NO_WAY,
            /* 286 */  NO_WAY,  /* 287 */  NO_WAY,  /* 288 */  NO_WAY,
            /* 289 */  NO_WAY,  /* 290 */  NO_WAY,  /* 291 */  NO_WAY,
            /* 292 */  NO_WAY,  /* 293 */  NO_WAY,  /* 294 */  NO_WAY,
            /* 295 */  NO_WAY,  /* 296 */  NO_WAY,  /* 297 */  NO_WAY,
            /* 298 */  NO_WAY,  /* 299 */  NO_WAY,  /* 300 */  NO_WAY,
            /* 301 */  NO_WAY,  /* 302 */  NO_WAY,  /* 303 */  NO_WAY,
            /* 304 */  NO_WAY,  /* 305 */  NO_WAY,  /* 306 */  NO_WAY,
            /* 307 */  NO_WAY,  /* 308 */  NO_WAY,  /* 309 */  NO_WAY,
            /* 310 */  NO_WAY,  /* 311 */  NO_WAY,  /* 312 */  NO_WAY,
            /* 313 */  YES_DO,  /* 314 */  NO_WAY,  /* 315 */  NO_WAY,
            /* 316 */  NO_WAY,  /* 317 */  NO_WAY,  /* 318 */  NO_WAY,
            /* 319 */  NO_WAY,  /* 320 */  NO_WAY,  /* 321 */  NO_WAY,
            /* 322 */  NO_WAY,  /* 323 */  NO_WAY,  /* 324 */  NO_WAY,
            /* 325 */  NO_WAY,  /* 326 */  NO_WAY,  /* 327 */  NO_WAY,
            /* 328 */  NO_WAY,  /* 329 */  NO_WAY,  /* 330 */  NO_WAY,
            /* 331 */  NO_WAY,  /* 332 */  NO_WAY,  /* 333 */  NO_WAY,
            /* 334 */  NO_WAY,  /* 335 */  NO_WAY,  /* 336 */  NO_WAY,
            /* 337 */  NO_WAY,  /* 338 */  NO_WAY,  /* 339 */  NO_WAY,
            /* 340 */  NO_WAY,  /* 341 */  NO_WAY,  /* 342 */  NO_WAY,
            /* 343 */  NO_WAY,  /* 344 */  NO_WAY,  /* 345 */  NO_WAY,
            /* 346 */  NO_WAY,  /* 347 */  NO_WAY,  /* 348 */  NO_WAY,
            /* 349 */  NO_WAY,  /* 350 */  NO_WAY,  /* 351 */  NO_WAY,
            /* 352 */  NO_WAY,  /* 353 */  NO_WAY,  /* 354 */  NO_WAY,
            /* 355 */  NO_WAY,  /* 356 */  NO_WAY,  /* 357 */  NO_WAY,
            /* 358 */  NO_WAY,  /* 359 */  NO_WAY,  /* 360 */  NO_WAY,
            /* 361 */  NO_WAY,  /* 362 */  NO_WAY,  /* 363 */  NO_WAY,
            /* 364 */  NO_WAY,  /* 365 */  NO_WAY),
1     2  LINE,
         3  NEXT_LINE  BIT(1) INIT(
            /*   0 */  NO_WAY,
            /*   1 */  NO_WAY,  /*   2 */  NO_WAY,  /*   3 */  NO_WAY,
            /*   4 */  NO_WAY,  /*   5 */  NO_WAY,  /*   6 */  NO_WAY,
            /*   7 */  NO_WAY,  /*   8 */  NO_WAY,  /*   9 */  NO_WAY,
            /*  10 */  NO_WAY,  /*  11 */  YES_DO,  /*  12 */  NO_WAY,
            /*  13 */  NO_WAY,  /*  14 */  NO_WAY,  /*  15 */  NO_WAY,
            /*  16 */  NO_WAY,  /*  17 */  NO_WAY,  /*  18 */  NO_WAY,
            /*  19 */  NO_WAY,  /*  20 */  NO_WAY,  /*  21 */  NO_WAY,
            /*  22 */  NO_WAY,  /*  23 */  NO_WAY,  /*  24 */  NO_WAY,
            /*  25 */  NO_WAY,  /*  26 */  NO_WAY,  /*  27 */  NO_WAY,
            /*  28 */  NO_WAY,  /*  29 */  NO_WAY,  /*  30 */  NO_WAY,
            /*  31 */  NO_WAY,  /*  32 */  NO_WAY,  /*  33 */  NO_WAY,
            /*  34 */  NO_WAY,  /*  35 */  NO_WAY,  /*  36 */  NO_WAY,
            /*  37 */  NO_WAY,  /*  38 */  NO_WAY,  /*  39 */  NO_WAY,
            /*  40 */  NO_WAY,  /*  41 */  NO_WAY,  /*  42 */  NO_WAY,
            /*  43 */  NO_WAY,  /*  44 */  NO_WAY,  /*  45 */  NO_WAY,
            /*  46 */  NO_WAY,  /*  47 */  NO_WAY,  /*  48 */  NO_WAY,
            /*  49 */  NO_WAY,  /*  50 */  NO_WAY,  /*  51 */  NO_WAY,
            /*  52 */  NO_WAY,  /*  53 */  NO_WAY,  /*  54 */  NO_WAY,
            /*  55 */  NO_WAY,  /*  56 */  NO_WAY,  /*  57 */  NO_WAY,
            /*  58 */  NO_WAY,  /*  59 */  NO_WAY,  /*  60 */  NO_WAY,
            /*  61 */  NO_WAY,  /*  62 */  NO_WAY,  /*  63 */  NO_WAY,
            /*  64 */  NO_WAY,  /*  65 */  NO_WAY,  /*  66 */  NO_WAY,
            /*  67 */  NO_WAY,  /*  68 */  NO_WAY,  /*  69 */  NO_WAY,
            /*  70 */  NO_WAY,  /*  71 */  NO_WAY,  /*  72 */  NO_WAY,
            /*  73 */  NO_WAY,  /*  74 */  NO_WAY,  /*  75 */  NO_WAY,
            /*  76 */  NO_WAY,  /*  77 */  NO_WAY,  /*  78 */  NO_WAY,
            /*  79 */  NO_WAY,  /*  80 */  NO_WAY,  /*  81 */  NO_WAY,
            /*  82 */  NO_WAY,  /*  83 */  NO_WAY,  /*  84 */  NO_WAY,
            /*  85 */  NO_WAY,  /*  86 */  NO_WAY,  /*  87 */  NO_WAY,
            /*  88 */  NO_WAY,  /*  89 */  NO_WAY,  /*  90 */  NO_WAY,
            /*  91 */  NO_WAY,  /*  92 */  NO_WAY,  /*  93 */  NO_WAY,
            /*  94 */  NO_WAY,  /*  95 */  NO_WAY,  /*  96 */  NO_WAY,
            /*  97 */  NO_WAY,  /*  98 */  NO_WAY,  /*  99 */  NO_WAY,
            /* 100 */  NO_WAY,  /* 101 */  NO_WAY,  /* 102 */  NO_WAY,
            /* 103 */  NO_WAY,  /* 104 */  NO_WAY,  /* 105 */  NO_WAY,
            /* 106 */  NO_WAY,  /* 107 */  NO_WAY,  /* 108 */  NO_WAY,
            /* 109 */  NO_WAY,  /* 110 */  NO_WAY,  /* 111 */  NO_WAY,
            /* 112 */  NO_WAY,  /* 113 */  NO_WAY,  /* 114 */  NO_WAY,
            /* 115 */  NO_WAY,  /* 116 */  NO_WAY,  /* 117 */  NO_WAY,
            /* 118 */  NO_WAY,  /* 119 */  NO_WAY,  /* 120 */  NO_WAY,
            /* 121 */  NO_WAY,  /* 122 */  NO_WAY,  /* 123 */  NO_WAY,
            /* 124 */  NO_WAY,  /* 125 */  NO_WAY,  /* 126 */  NO_WAY,
1           /* 127 */  NO_WAY,  /* 128 */  NO_WAY,  /* 129 */  NO_WAY,
            /* 130 */  NO_WAY,  /* 131 */  NO_WAY,  /* 132 */  NO_WAY,
            /* 133 */  NO_WAY,  /* 134 */  NO_WAY,  /* 135 */  NO_WAY,
            /* 136 */  NO_WAY,  /* 137 */  NO_WAY,  /* 138 */  NO_WAY,
            /* 139 */  NO_WAY,  /* 140 */  NO_WAY,  /* 141 */  NO_WAY,
            /* 142 */  NO_WAY,  /* 143 */  NO_WAY,  /* 144 */  NO_WAY,
            /* 145 */  NO_WAY,  /* 146 */  NO_WAY,  /* 147 */  NO_WAY,
            /* 148 */  NO_WAY,  /* 149 */  NO_WAY,  /* 150 */  NO_WAY,
            /* 151 */  NO_WAY,  /* 152 */  NO_WAY,  /* 153 */  NO_WAY,
            /* 154 */  NO_WAY,  /* 155 */  NO_WAY,  /* 156 */  NO_WAY,
            /* 157 */  NO_WAY,  /* 158 */  NO_WAY,  /* 159 */  NO_WAY,
            /* 160 */  NO_WAY,  /* 161 */  NO_WAY,  /* 162 */  NO_WAY,
            /* 163 */  NO_WAY,  /* 164 */  NO_WAY,  /* 165 */  NO_WAY,
            /* 166 */  NO_WAY,  /* 167 */  NO_WAY,  /* 168 */  NO_WAY,
            /* 169 */  NO_WAY,  /* 170 */  NO_WAY,  /* 171 */  NO_WAY,
            /* 172 */  NO_WAY,  /* 173 */  NO_WAY,  /* 174 */  NO_WAY,
            /* 175 */  NO_WAY,  /* 176 */  NO_WAY,  /* 177 */  NO_WAY,
            /* 178 */  NO_WAY,  /* 179 */  NO_WAY,  /* 180 */  NO_WAY,
            /* 181 */  NO_WAY,  /* 182 */  NO_WAY,  /* 183 */  NO_WAY,
            /* 184 */  NO_WAY,  /* 185 */  NO_WAY,  /* 186 */  NO_WAY,
            /* 187 */  NO_WAY,  /* 188 */  NO_WAY,  /* 189 */  NO_WAY,
            /* 190 */  NO_WAY,  /* 191 */  NO_WAY,  /* 192 */  NO_WAY,
            /* 193 */  NO_WAY,  /* 194 */  NO_WAY,  /* 195 */  NO_WAY,
            /* 196 */  NO_WAY,  /* 197 */  NO_WAY,  /* 198 */  NO_WAY,
            /* 199 */  NO_WAY,  /* 200 */  NO_WAY,  /* 201 */  NO_WAY,
            /* 202 */  NO_WAY,  /* 203 */  NO_WAY,  /* 204 */  NO_WAY,
            /* 205 */  NO_WAY,  /* 206 */  NO_WAY,  /* 207 */  NO_WAY,
            /* 208 */  NO_WAY,  /* 209 */  NO_WAY,  /* 210 */  NO_WAY,
            /* 211 */  NO_WAY,  /* 212 */  NO_WAY,  /* 213 */  NO_WAY,
            /* 214 */  NO_WAY,  /* 215 */  NO_WAY,  /* 216 */  NO_WAY,
            /* 217 */  NO_WAY,  /* 218 */  NO_WAY,  /* 219 */  NO_WAY,
            /* 220 */  NO_WAY,  /* 221 */  NO_WAY,  /* 222 */  NO_WAY,
            /* 223 */  NO_WAY,  /* 224 */  NO_WAY,  /* 225 */  NO_WAY,
            /* 226 */  NO_WAY,  /* 227 */  NO_WAY,  /* 228 */  NO_WAY,
            /* 229 */  NO_WAY,  /* 230 */  NO_WAY,  /* 231 */  NO_WAY,
            /* 232 */  NO_WAY,  /* 233 */  NO_WAY,  /* 234 */  NO_WAY,
            /* 235 */  NO_WAY,  /* 236 */  NO_WAY,  /* 237 */  NO_WAY,
            /* 238 */  NO_WAY,  /* 239 */  NO_WAY,  /* 240 */  NO_WAY,
            /* 241 */  NO_WAY,  /* 242 */  NO_WAY,  /* 243 */  NO_WAY,
            /* 244 */  NO_WAY,  /* 245 */  NO_WAY,  /* 246 */  NO_WAY,
            /* 247 */  NO_WAY,  /* 248 */  NO_WAY,  /* 249 */  NO_WAY,
            /* 250 */  NO_WAY,  /* 251 */  NO_WAY,  /* 252 */  NO_WAY,
            /* 253 */  NO_WAY,  /* 254 */  NO_WAY,  /* 255 */  NO_WAY,
            /* 256 */  NO_WAY,  /* 257 */  NO_WAY,  /* 258 */  NO_WAY,
1           /* 259 */  NO_WAY,  /* 260 */  NO_WAY,  /* 261 */  NO_WAY,
            /* 262 */  NO_WAY,  /* 263 */  NO_WAY,  /* 264 */  NO_WAY,
            /* 265 */  NO_WAY,  /* 266 */  NO_WAY,  /* 267 */  NO_WAY,
            /* 268 */  NO_WAY,  /* 269 */  NO_WAY,  /* 270 */  NO_WAY,
            /* 271 */  NO_WAY,  /* 272 */  NO_WAY,  /* 273 */  NO_WAY,
            /* 274 */  NO_WAY,  /* 275 */  NO_WAY,  /* 276 */  NO_WAY,
            /* 277 */  NO_WAY,  /* 278 */  NO_WAY,  /* 279 */  NO_WAY,
            /* 280 */  NO_WAY,  /* 281 */  NO_WAY,  /* 282 */  NO_WAY,
            /* 283 */  NO_WAY,  /* 284 */  NO_WAY,  /* 285 */  NO_WAY,
            /* 286 */  NO_WAY,  /* 287 */  NO_WAY,  /* 288 */  NO_WAY,
            /* 289 */  NO_WAY,  /* 290 */  NO_WAY,  /* 291 */  NO_WAY,
            /* 292 */  NO_WAY,  /* 293 */  NO_WAY,  /* 294 */  NO_WAY,
            /* 295 */  NO_WAY,  /* 296 */  NO_WAY,  /* 297 */  NO_WAY,
            /* 298 */  NO_WAY,  /* 299 */  NO_WAY,  /* 300 */  NO_WAY,
            /* 301 */  NO_WAY,  /* 302 */  NO_WAY,  /* 303 */  NO_WAY,
            /* 304 */  NO_WAY,  /* 305 */  NO_WAY,  /* 306 */  NO_WAY,
            /* 307 */  NO_WAY,  /* 308 */  NO_WAY,  /* 309 */  NO_WAY,
            /* 310 */  NO_WAY,  /* 311 */  NO_WAY,  /* 312 */  NO_WAY,
            /* 313 */  NO_WAY,  /* 314 */  NO_WAY,  /* 315 */  NO_WAY,
            /* 316 */  NO_WAY,  /* 317 */  NO_WAY,  /* 318 */  NO_WAY,
            /* 319 */  NO_WAY,  /* 320 */  NO_WAY,  /* 321 */  NO_WAY,
            /* 322 */  NO_WAY,  /* 323 */  NO_WAY,  /* 324 */  NO_WAY,
            /* 325 */  NO_WAY,  /* 326 */  NO_WAY,  /* 327 */  NO_WAY,
            /* 328 */  NO_WAY,  /* 329 */  NO_WAY,  /* 330 */  NO_WAY,
            /* 331 */  NO_WAY,  /* 332 */  NO_WAY,  /* 333 */  NO_WAY,
            /* 334 */  NO_WAY,  /* 335 */  NO_WAY,  /* 336 */  NO_WAY,
            /* 337 */  NO_WAY,  /* 338 */  NO_WAY,  /* 339 */  NO_WAY,
            /* 340 */  NO_WAY,  /* 341 */  NO_WAY,  /* 342 */  NO_WAY,
            /* 343 */  NO_WAY,  /* 344 */  NO_WAY,  /* 345 */  NO_WAY,
            /* 346 */  NO_WAY,  /* 347 */  NO_WAY,  /* 348 */  NO_WAY,
            /* 349 */  NO_WAY,  /* 350 */  NO_WAY,  /* 351 */  NO_WAY,
            /* 352 */  NO_WAY,  /* 353 */  NO_WAY,  /* 354 */  NO_WAY,
            /* 355 */  NO_WAY,  /* 356 */  NO_WAY,  /* 357 */  NO_WAY,
            /* 358 */  NO_WAY,  /* 359 */  NO_WAY,  /* 360 */  NO_WAY,
            /* 361 */  NO_WAY,  /* 362 */  NO_WAY,  /* 363 */  NO_WAY,
            /* 364 */  NO_WAY,  /* 365 */  NO_WAY),
1        3  DOUBLE_SPACE  BIT(1) INIT(
            /*   0 */  NO_WAY,
            /*   1 */  NO_WAY,  /*   2 */  NO_WAY,  /*   3 */  NO_WAY,
            /*   4 */  NO_WAY,  /*   5 */  NO_WAY,  /*   6 */  NO_WAY,
            /*   7 */  NO_WAY,  /*   8 */  NO_WAY,  /*   9 */  NO_WAY,
            /*  10 */  NO_WAY,  /*  11 */  NO_WAY,  /*  12 */  NO_WAY,
            /*  13 */  NO_WAY,  /*  14 */  NO_WAY,  /*  15 */  NO_WAY,
            /*  16 */  NO_WAY,  /*  17 */  NO_WAY,  /*  18 */  NO_WAY,
            /*  19 */  NO_WAY,  /*  20 */  NO_WAY,  /*  21 */  YES_DO,
            /*  22 */  NO_WAY,  /*  23 */  YES_DO,  /*  24 */  YES_DO,
            /*  25 */  NO_WAY,  /*  26 */  NO_WAY,  /*  27 */  NO_WAY,
            /*  28 */  NO_WAY,  /*  29 */  NO_WAY,  /*  30 */  YES_DO,
            /*  31 */  NO_WAY,  /*  32 */  NO_WAY,  /*  33 */  NO_WAY,
            /*  34 */  NO_WAY,  /*  35 */  NO_WAY,  /*  36 */  NO_WAY,
            /*  37 */  NO_WAY,  /*  38 */  NO_WAY,  /*  39 */  NO_WAY,
            /*  40 */  NO_WAY,  /*  41 */  NO_WAY,  /*  42 */  NO_WAY,
            /*  43 */  NO_WAY,  /*  44 */  NO_WAY,  /*  45 */  NO_WAY,
            /*  46 */  NO_WAY,  /*  47 */  NO_WAY,  /*  48 */  NO_WAY,
            /*  49 */  NO_WAY,  /*  50 */  NO_WAY,  /*  51 */  NO_WAY,
            /*  52 */  NO_WAY,  /*  53 */  NO_WAY,  /*  54 */  NO_WAY,
            /*  55 */  NO_WAY,  /*  56 */  NO_WAY,  /*  57 */  NO_WAY,
            /*  58 */  NO_WAY,  /*  59 */  NO_WAY,  /*  60 */  NO_WAY,
            /*  61 */  NO_WAY,  /*  62 */  NO_WAY,  /*  63 */  NO_WAY,
            /*  64 */  NO_WAY,  /*  65 */  YES_DO,  /*  66 */  NO_WAY,
            /*  67 */  NO_WAY,  /*  68 */  NO_WAY,  /*  69 */  NO_WAY,
            /*  70 */  NO_WAY,  /*  71 */  NO_WAY,  /*  72 */  NO_WAY,
            /*  73 */  NO_WAY,  /*  74 */  NO_WAY,  /*  75 */  NO_WAY,
            /*  76 */  NO_WAY,  /*  77 */  NO_WAY,  /*  78 */  NO_WAY,
            /*  79 */  NO_WAY,  /*  80 */  NO_WAY,  /*  81 */  NO_WAY,
            /*  82 */  NO_WAY,  /*  83 */  NO_WAY,  /*  84 */  NO_WAY,
            /*  85 */  NO_WAY,  /*  86 */  NO_WAY,  /*  87 */  NO_WAY,
            /*  88 */  NO_WAY,  /*  89 */  NO_WAY,  /*  90 */  NO_WAY,
            /*  91 */  NO_WAY,  /*  92 */  NO_WAY,  /*  93 */  NO_WAY,
            /*  94 */  NO_WAY,  /*  95 */  NO_WAY,  /*  96 */  NO_WAY,
            /*  97 */  NO_WAY,  /*  98 */  NO_WAY,  /*  99 */  NO_WAY,
            /* 100 */  NO_WAY,  /* 101 */  NO_WAY,  /* 102 */  NO_WAY,
            /* 103 */  NO_WAY,  /* 104 */  NO_WAY,  /* 105 */  NO_WAY,
            /* 106 */  NO_WAY,  /* 107 */  NO_WAY,  /* 108 */  NO_WAY,
            /* 109 */  NO_WAY,  /* 110 */  NO_WAY,  /* 111 */  NO_WAY,
            /* 112 */  NO_WAY,  /* 113 */  YES_DO,  /* 114 */  YES_DO,
            /* 115 */  NO_WAY,  /* 116 */  NO_WAY,  /* 117 */  NO_WAY,
            /* 118 */  NO_WAY,  /* 119 */  NO_WAY,  /* 120 */  NO_WAY,
            /* 121 */  NO_WAY,  /* 122 */  NO_WAY,  /* 123 */  NO_WAY,
            /* 124 */  NO_WAY,  /* 125 */  NO_WAY,  /* 126 */  NO_WAY,
            /* 127 */  NO_WAY,  /* 128 */  NO_WAY,  /* 129 */  NO_WAY,
1           /* 130 */  NO_WAY,  /* 131 */  NO_WAY,  /* 132 */  NO_WAY,
            /* 133 */  NO_WAY,  /* 134 */  NO_WAY,  /* 135 */  NO_WAY,
            /* 136 */  NO_WAY,  /* 137 */  NO_WAY,  /* 138 */  NO_WAY,
            /* 139 */  NO_WAY,  /* 140 */  NO_WAY,  /* 141 */  NO_WAY,
            /* 142 */  NO_WAY,  /* 143 */  NO_WAY,  /* 144 */  NO_WAY,
            /* 145 */  NO_WAY,  /* 146 */  NO_WAY,  /* 147 */  NO_WAY,
            /* 148 */  NO_WAY,  /* 149 */  NO_WAY,  /* 150 */  NO_WAY,
            /* 151 */  NO_WAY,  /* 152 */  NO_WAY,  /* 153 */  NO_WAY,
            /* 154 */  NO_WAY,  /* 155 */  NO_WAY,  /* 156 */  NO_WAY,
            /* 157 */  NO_WAY,  /* 158 */  NO_WAY,  /* 159 */  NO_WAY,
            /* 160 */  NO_WAY,  /* 161 */  NO_WAY,  /* 162 */  NO_WAY,
            /* 163 */  NO_WAY,  /* 164 */  NO_WAY,  /* 165 */  NO_WAY,
            /* 166 */  NO_WAY,  /* 167 */  NO_WAY,  /* 168 */  NO_WAY,
            /* 169 */  NO_WAY,  /* 170 */  NO_WAY,  /* 171 */  NO_WAY,
            /* 172 */  NO_WAY,  /* 173 */  NO_WAY,  /* 174 */  NO_WAY,
            /* 175 */  NO_WAY,  /* 176 */  NO_WAY,  /* 177 */  NO_WAY,
            /* 178 */  NO_WAY,  /* 179 */  NO_WAY,  /* 180 */  NO_WAY,
            /* 181 */  NO_WAY,  /* 182 */  NO_WAY,  /* 183 */  NO_WAY,
            /* 184 */  NO_WAY,  /* 185 */  NO_WAY,  /* 186 */  NO_WAY,
            /* 187 */  NO_WAY,  /* 188 */  NO_WAY,  /* 189 */  NO_WAY,
            /* 190 */  NO_WAY,  /* 191 */  NO_WAY,  /* 192 */  NO_WAY,
            /* 193 */  NO_WAY,  /* 194 */  NO_WAY,  /* 195 */  NO_WAY,
            /* 196 */  NO_WAY,  /* 197 */  NO_WAY,  /* 198 */  NO_WAY,
            /* 199 */  NO_WAY,  /* 200 */  NO_WAY,  /* 201 */  NO_WAY,
            /* 202 */  NO_WAY,  /* 203 */  NO_WAY,  /* 204 */  NO_WAY,
            /* 205 */  NO_WAY,  /* 206 */  NO_WAY,  /* 207 */  NO_WAY,
            /* 208 */  NO_WAY,  /* 209 */  NO_WAY,  /* 210 */  NO_WAY,
            /* 211 */  NO_WAY,  /* 212 */  NO_WAY,  /* 213 */  NO_WAY,
            /* 214 */  NO_WAY,  /* 215 */  NO_WAY,  /* 216 */  NO_WAY,
            /* 217 */  NO_WAY,  /* 218 */  NO_WAY,  /* 219 */  NO_WAY,
            /* 220 */  NO_WAY,  /* 221 */  NO_WAY,  /* 222 */  NO_WAY,
            /* 223 */  NO_WAY,  /* 224 */  YES_DO,  /* 225 */  NO_WAY,
            /* 226 */  NO_WAY,  /* 227 */  NO_WAY,  /* 228 */  NO_WAY,
            /* 229 */  NO_WAY,  /* 230 */  NO_WAY,  /* 231 */  NO_WAY,
            /* 232 */  NO_WAY,  /* 233 */  NO_WAY,  /* 234 */  NO_WAY,
            /* 235 */  NO_WAY,  /* 236 */  NO_WAY,  /* 237 */  NO_WAY,
            /* 238 */  NO_WAY,  /* 239 */  NO_WAY,  /* 240 */  NO_WAY,
            /* 241 */  NO_WAY,  /* 242 */  NO_WAY,  /* 243 */  NO_WAY,
            /* 244 */  NO_WAY,  /* 245 */  NO_WAY,  /* 246 */  NO_WAY,
            /* 247 */  NO_WAY,  /* 248 */  NO_WAY,  /* 249 */  NO_WAY,
            /* 250 */  NO_WAY,  /* 251 */  NO_WAY,  /* 252 */  NO_WAY,
            /* 253 */  NO_WAY,  /* 254 */  NO_WAY,  /* 255 */  NO_WAY,
            /* 256 */  NO_WAY,  /* 257 */  NO_WAY,  /* 258 */  NO_WAY,
            /* 259 */  NO_WAY,  /* 260 */  NO_WAY,  /* 261 */  NO_WAY,
1           /* 262 */  NO_WAY,  /* 263 */  NO_WAY,  /* 264 */  NO_WAY,
            /* 265 */  NO_WAY,  /* 266 */  NO_WAY,  /* 267 */  NO_WAY,
            /* 268 */  NO_WAY,  /* 269 */  NO_WAY,  /* 270 */  NO_WAY,
            /* 271 */  NO_WAY,  /* 272 */  NO_WAY,  /* 273 */  NO_WAY,
            /* 274 */  NO_WAY,  /* 275 */  NO_WAY,  /* 276 */  NO_WAY,
            /* 277 */  NO_WAY,  /* 278 */  NO_WAY,  /* 279 */  NO_WAY,
            /* 280 */  NO_WAY,  /* 281 */  NO_WAY,  /* 282 */  NO_WAY,
            /* 283 */  NO_WAY,  /* 284 */  NO_WAY,  /* 285 */  NO_WAY,
            /* 286 */  NO_WAY,  /* 287 */  NO_WAY,  /* 288 */  NO_WAY,
            /* 289 */  NO_WAY,  /* 290 */  NO_WAY,  /* 291 */  NO_WAY,
            /* 292 */  NO_WAY,  /* 293 */  NO_WAY,  /* 294 */  NO_WAY,
            /* 295 */  NO_WAY,  /* 296 */  NO_WAY,  /* 297 */  NO_WAY,
            /* 298 */  NO_WAY,  /* 299 */  NO_WAY,  /* 300 */  NO_WAY,
            /* 301 */  NO_WAY,  /* 302 */  NO_WAY,  /* 303 */  NO_WAY,
            /* 304 */  NO_WAY,  /* 305 */  NO_WAY,  /* 306 */  NO_WAY,
            /* 307 */  NO_WAY,  /* 308 */  NO_WAY,  /* 309 */  NO_WAY,
            /* 310 */  NO_WAY,  /* 311 */  NO_WAY,  /* 312 */  NO_WAY,
            /* 313 */  NO_WAY,  /* 314 */  NO_WAY,  /* 315 */  NO_WAY,
            /* 316 */  NO_WAY,  /* 317 */  NO_WAY,  /* 318 */  NO_WAY,
            /* 319 */  NO_WAY,  /* 320 */  NO_WAY,  /* 321 */  NO_WAY,
            /* 322 */  NO_WAY,  /* 323 */  NO_WAY,  /* 324 */  NO_WAY,
            /* 325 */  NO_WAY,  /* 326 */  NO_WAY,  /* 327 */  NO_WAY,
            /* 328 */  NO_WAY,  /* 329 */  NO_WAY,  /* 330 */  NO_WAY,
            /* 331 */  NO_WAY,  /* 332 */  NO_WAY,  /* 333 */  NO_WAY,
            /* 334 */  NO_WAY,  /* 335 */  NO_WAY,  /* 336 */  NO_WAY,
            /* 337 */  NO_WAY,  /* 338 */  NO_WAY,  /* 339 */  NO_WAY,
            /* 340 */  NO_WAY,  /* 341 */  NO_WAY,  /* 342 */  NO_WAY,
            /* 343 */  NO_WAY,  /* 344 */  NO_WAY,  /* 345 */  NO_WAY,
            /* 346 */  NO_WAY,  /* 347 */  NO_WAY,  /* 348 */  NO_WAY,
            /* 349 */  NO_WAY,  /* 350 */  NO_WAY,  /* 351 */  NO_WAY,
            /* 352 */  NO_WAY,  /* 353 */  NO_WAY,  /* 354 */  NO_WAY,
            /* 355 */  NO_WAY,  /* 356 */  NO_WAY,  /* 357 */  NO_WAY,
            /* 358 */  NO_WAY,  /* 359 */  NO_WAY,  /* 360 */  NO_WAY,
            /* 361 */  NO_WAY,  /* 362 */  NO_WAY,  /* 363 */  NO_WAY,
            /* 364 */  NO_WAY,  /* 365 */  NO_WAY),
1        3  TRIPLE_SPACE  BIT(1) INIT(
            /*   0 */  NO_WAY,
            /*   1 */  NO_WAY,  /*   2 */  NO_WAY,  /*   3 */  NO_WAY,
            /*   4 */  NO_WAY,  /*   5 */  NO_WAY,  /*   6 */  NO_WAY,
            /*   7 */  NO_WAY,  /*   8 */  NO_WAY,  /*   9 */  NO_WAY,
            /*  10 */  NO_WAY,  /*  11 */  NO_WAY,  /*  12 */  NO_WAY,
            /*  13 */  NO_WAY,  /*  14 */  NO_WAY,  /*  15 */  NO_WAY,
            /*  16 */  NO_WAY,  /*  17 */  NO_WAY,  /*  18 */  NO_WAY,
            /*  19 */  NO_WAY,  /*  20 */  NO_WAY,  /*  21 */  NO_WAY,
            /*  22 */  NO_WAY,  /*  23 */  NO_WAY,  /*  24 */  NO_WAY,
            /*  25 */  NO_WAY,  /*  26 */  NO_WAY,  /*  27 */  NO_WAY,
            /*  28 */  NO_WAY,  /*  29 */  NO_WAY,  /*  30 */  NO_WAY,
            /*  31 */  NO_WAY,  /*  32 */  NO_WAY,  /*  33 */  NO_WAY,
            /*  34 */  NO_WAY,  /*  35 */  YES_DO,  /*  36 */  NO_WAY,
            /*  37 */  NO_WAY,  /*  38 */  NO_WAY,  /*  39 */  NO_WAY,
            /*  40 */  NO_WAY,  /*  41 */  NO_WAY,  /*  42 */  NO_WAY,
            /*  43 */  NO_WAY,  /*  44 */  NO_WAY,  /*  45 */  NO_WAY,
            /*  46 */  NO_WAY,  /*  47 */  NO_WAY,  /*  48 */  NO_WAY,
            /*  49 */  NO_WAY,  /*  50 */  NO_WAY,  /*  51 */  NO_WAY,
            /*  52 */  NO_WAY,  /*  53 */  NO_WAY,  /*  54 */  NO_WAY,
            /*  55 */  NO_WAY,  /*  56 */  NO_WAY,  /*  57 */  NO_WAY,
            /*  58 */  NO_WAY,  /*  59 */  NO_WAY,  /*  60 */  NO_WAY,
            /*  61 */  NO_WAY,  /*  62 */  NO_WAY,  /*  63 */  NO_WAY,
            /*  64 */  NO_WAY,  /*  65 */  NO_WAY,  /*  66 */  NO_WAY,
            /*  67 */  NO_WAY,  /*  68 */  NO_WAY,  /*  69 */  NO_WAY,
            /*  70 */  NO_WAY,  /*  71 */  NO_WAY,  /*  72 */  NO_WAY,
            /*  73 */  NO_WAY,  /*  74 */  NO_WAY,  /*  75 */  NO_WAY,
            /*  76 */  NO_WAY,  /*  77 */  NO_WAY,  /*  78 */  NO_WAY,
            /*  79 */  NO_WAY,  /*  80 */  NO_WAY,  /*  81 */  NO_WAY,
            /*  82 */  NO_WAY,  /*  83 */  NO_WAY,  /*  84 */  NO_WAY,
            /*  85 */  NO_WAY,  /*  86 */  NO_WAY,  /*  87 */  NO_WAY,
            /*  88 */  NO_WAY,  /*  89 */  NO_WAY,  /*  90 */  NO_WAY,
            /*  91 */  NO_WAY,  /*  92 */  NO_WAY,  /*  93 */  NO_WAY,
            /*  94 */  NO_WAY,  /*  95 */  NO_WAY,  /*  96 */  NO_WAY,
            /*  97 */  NO_WAY,  /*  98 */  NO_WAY,  /*  99 */  NO_WAY,
            /* 100 */  NO_WAY,  /* 101 */  NO_WAY,  /* 102 */  NO_WAY,
            /* 103 */  NO_WAY,  /* 104 */  NO_WAY,  /* 105 */  NO_WAY,
            /* 106 */  NO_WAY,  /* 107 */  NO_WAY,  /* 108 */  NO_WAY,
            /* 109 */  NO_WAY,  /* 110 */  NO_WAY,  /* 111 */  NO_WAY,
            /* 112 */  NO_WAY,  /* 113 */  NO_WAY,  /* 114 */  NO_WAY,
            /* 115 */  NO_WAY,  /* 116 */  NO_WAY,  /* 117 */  NO_WAY,
            /* 118 */  NO_WAY,  /* 119 */  NO_WAY,  /* 120 */  NO_WAY,
            /* 121 */  NO_WAY,  /* 122 */  NO_WAY,  /* 123 */  NO_WAY,
            /* 124 */  NO_WAY,  /* 125 */  NO_WAY,  /* 126 */  NO_WAY,
            /* 127 */  NO_WAY,  /* 128 */  NO_WAY,  /* 129 */  NO_WAY,
1           /* 130 */  NO_WAY,  /* 131 */  YES_DO,  /* 132 */  NO_WAY,
            /* 133 */  NO_WAY,  /* 134 */  NO_WAY,  /* 135 */  NO_WAY,
            /* 136 */  NO_WAY,  /* 137 */  NO_WAY,  /* 138 */  NO_WAY,
            /* 139 */  NO_WAY,  /* 140 */  NO_WAY,  /* 141 */  NO_WAY,
            /* 142 */  NO_WAY,  /* 143 */  NO_WAY,  /* 144 */  NO_WAY,
            /* 145 */  NO_WAY,  /* 146 */  NO_WAY,  /* 147 */  NO_WAY,
            /* 148 */  NO_WAY,  /* 149 */  NO_WAY,  /* 150 */  NO_WAY,
            /* 151 */  NO_WAY,  /* 152 */  NO_WAY,  /* 153 */  NO_WAY,
            /* 154 */  NO_WAY,  /* 155 */  NO_WAY,  /* 156 */  NO_WAY,
            /* 157 */  NO_WAY,  /* 158 */  NO_WAY,  /* 159 */  NO_WAY,
            /* 160 */  NO_WAY,  /* 161 */  NO_WAY,  /* 162 */  NO_WAY,
            /* 163 */  NO_WAY,  /* 164 */  NO_WAY,  /* 165 */  NO_WAY,
            /* 166 */  NO_WAY,  /* 167 */  NO_WAY,  /* 168 */  NO_WAY,
            /* 169 */  NO_WAY,  /* 170 */  NO_WAY,  /* 171 */  NO_WAY,
            /* 172 */  NO_WAY,  /* 173 */  NO_WAY,  /* 174 */  NO_WAY,
            /* 175 */  NO_WAY,  /* 176 */  NO_WAY,  /* 177 */  NO_WAY,
            /* 178 */  NO_WAY,  /* 179 */  NO_WAY,  /* 180 */  NO_WAY,
            /* 181 */  NO_WAY,  /* 182 */  NO_WAY,  /* 183 */  NO_WAY,
            /* 184 */  NO_WAY,  /* 185 */  NO_WAY,  /* 186 */  NO_WAY,
            /* 187 */  NO_WAY,  /* 188 */  NO_WAY,  /* 189 */  NO_WAY,
            /* 190 */  NO_WAY,  /* 191 */  NO_WAY,  /* 192 */  NO_WAY,
            /* 193 */  NO_WAY,  /* 194 */  NO_WAY,  /* 195 */  NO_WAY,
            /* 196 */  NO_WAY,  /* 197 */  NO_WAY,  /* 198 */  NO_WAY,
            /* 199 */  NO_WAY,  /* 200 */  NO_WAY,  /* 201 */  NO_WAY,
            /* 202 */  NO_WAY,  /* 203 */  NO_WAY,  /* 204 */  NO_WAY,
            /* 205 */  NO_WAY,  /* 206 */  NO_WAY,  /* 207 */  NO_WAY,
            /* 208 */  NO_WAY,  /* 209 */  NO_WAY,  /* 210 */  NO_WAY,
            /* 211 */  NO_WAY,  /* 212 */  NO_WAY,  /* 213 */  NO_WAY,
            /* 214 */  NO_WAY,  /* 215 */  NO_WAY,  /* 216 */  NO_WAY,
            /* 217 */  NO_WAY,  /* 218 */  NO_WAY,  /* 219 */  NO_WAY,
            /* 220 */  NO_WAY,  /* 221 */  NO_WAY,  /* 222 */  NO_WAY,
            /* 223 */  NO_WAY,  /* 224 */  NO_WAY,  /* 225 */  NO_WAY,
            /* 226 */  NO_WAY,  /* 227 */  NO_WAY,  /* 228 */  NO_WAY,
            /* 229 */  NO_WAY,  /* 230 */  NO_WAY,  /* 231 */  NO_WAY,
            /* 232 */  NO_WAY,  /* 233 */  NO_WAY,  /* 234 */  NO_WAY,
            /* 235 */  NO_WAY,  /* 236 */  NO_WAY,  /* 237 */  NO_WAY,
            /* 238 */  NO_WAY,  /* 239 */  NO_WAY,  /* 240 */  NO_WAY,
            /* 241 */  NO_WAY,  /* 242 */  NO_WAY,  /* 243 */  NO_WAY,
            /* 244 */  NO_WAY,  /* 245 */  NO_WAY,  /* 246 */  NO_WAY,
            /* 247 */  NO_WAY,  /* 248 */  NO_WAY,  /* 249 */  NO_WAY,
            /* 250 */  NO_WAY,  /* 251 */  NO_WAY,  /* 252 */  YES_DO,
            /* 253 */  NO_WAY,  /* 254 */  NO_WAY,  /* 255 */  NO_WAY,
            /* 256 */  NO_WAY,  /* 257 */  NO_WAY,  /* 258 */  NO_WAY,
            /* 259 */  NO_WAY,  /* 260 */  NO_WAY,  /* 261 */  NO_WAY,
1           /* 262 */  NO_WAY,  /* 263 */  NO_WAY,  /* 264 */  NO_WAY,
            /* 265 */  NO_WAY,  /* 266 */  NO_WAY,  /* 267 */  NO_WAY,
            /* 268 */  NO_WAY,  /* 269 */  NO_WAY,  /* 270 */  NO_WAY,
            /* 271 */  NO_WAY,  /* 272 */  NO_WAY,  /* 273 */  NO_WAY,
            /* 274 */  NO_WAY,  /* 275 */  NO_WAY,  /* 276 */  NO_WAY,
            /* 277 */  NO_WAY,  /* 278 */  NO_WAY,  /* 279 */  NO_WAY,
            /* 280 */  NO_WAY,  /* 281 */  NO_WAY,  /* 282 */  NO_WAY,
            /* 283 */  NO_WAY,  /* 284 */  NO_WAY,  /* 285 */  NO_WAY,
            /* 286 */  NO_WAY,  /* 287 */  NO_WAY,  /* 288 */  NO_WAY,
            /* 289 */  NO_WAY,  /* 290 */  NO_WAY,  /* 291 */  NO_WAY,
            /* 292 */  NO_WAY,  /* 293 */  NO_WAY,  /* 294 */  NO_WAY,
            /* 295 */  NO_WAY,  /* 296 */  NO_WAY,  /* 297 */  NO_WAY,
            /* 298 */  NO_WAY,  /* 299 */  NO_WAY,  /* 300 */  NO_WAY,
            /* 301 */  NO_WAY,  /* 302 */  NO_WAY,  /* 303 */  NO_WAY,
            /* 304 */  NO_WAY,  /* 305 */  NO_WAY,  /* 306 */  NO_WAY,
            /* 307 */  NO_WAY,  /* 308 */  NO_WAY,  /* 309 */  NO_WAY,
            /* 310 */  NO_WAY,  /* 311 */  NO_WAY,  /* 312 */  NO_WAY,
            /* 313 */  NO_WAY,  /* 314 */  NO_WAY,  /* 315 */  NO_WAY,
            /* 316 */  NO_WAY,  /* 317 */  NO_WAY,  /* 318 */  NO_WAY,
            /* 319 */  NO_WAY,  /* 320 */  NO_WAY,  /* 321 */  NO_WAY,
            /* 322 */  NO_WAY,  /* 323 */  NO_WAY,  /* 324 */  NO_WAY,
            /* 325 */  NO_WAY,  /* 326 */  NO_WAY,  /* 327 */  NO_WAY,
            /* 328 */  NO_WAY,  /* 329 */  NO_WAY,  /* 330 */  NO_WAY,
            /* 331 */  NO_WAY,  /* 332 */  NO_WAY,  /* 333 */  NO_WAY,
            /* 334 */  NO_WAY,  /* 335 */  NO_WAY,  /* 336 */  NO_WAY,
            /* 337 */  NO_WAY,  /* 338 */  NO_WAY,  /* 339 */  NO_WAY,
            /* 340 */  NO_WAY,  /* 341 */  NO_WAY,  /* 342 */  NO_WAY,
            /* 343 */  NO_WAY,  /* 344 */  NO_WAY,  /* 345 */  NO_WAY,
            /* 346 */  NO_WAY,  /* 347 */  NO_WAY,  /* 348 */  NO_WAY,
            /* 349 */  NO_WAY,  /* 350 */  NO_WAY,  /* 351 */  NO_WAY,
            /* 352 */  NO_WAY,  /* 353 */  NO_WAY,  /* 354 */  NO_WAY,
            /* 355 */  NO_WAY,  /* 356 */  NO_WAY,  /* 357 */  NO_WAY,
            /* 358 */  NO_WAY,  /* 359 */  NO_WAY,  /* 360 */  NO_WAY,
            /* 361 */  NO_WAY,  /* 362 */  NO_WAY,  /* 363 */  NO_WAY,
            /* 364 */  NO_WAY,  /* 365 */  NO_WAY),
1        3  EJECT  BIT(1) INIT(
            /*   0 */  NO_WAY,
            /*   1 */  NO_WAY,  /*   2 */  NO_WAY,  /*   3 */  NO_WAY,
            /*   4 */  NO_WAY,  /*   5 */  NO_WAY,  /*   6 */  NO_WAY,
            /*   7 */  NO_WAY,  /*   8 */  NO_WAY,  /*   9 */  NO_WAY,
            /*  10 */  NO_WAY,  /*  11 */  NO_WAY,  /*  12 */  NO_WAY,
            /*  13 */  NO_WAY,  /*  14 */  NO_WAY,  /*  15 */  NO_WAY,
            /*  16 */  NO_WAY,  /*  17 */  NO_WAY,  /*  18 */  NO_WAY,
            /*  19 */  NO_WAY,  /*  20 */  NO_WAY,  /*  21 */  NO_WAY,
            /*  22 */  NO_WAY,  /*  23 */  NO_WAY,  /*  24 */  NO_WAY,
            /*  25 */  NO_WAY,  /*  26 */  NO_WAY,  /*  27 */  NO_WAY,
            /*  28 */  NO_WAY,  /*  29 */  NO_WAY,  /*  30 */  NO_WAY,
            /*  31 */  NO_WAY,  /*  32 */  NO_WAY,  /*  33 */  NO_WAY,
            /*  34 */  NO_WAY,  /*  35 */  YES_DO,  /*  36 */  NO_WAY,
            /*  37 */  NO_WAY,  /*  38 */  NO_WAY,  /*  39 */  NO_WAY,
            /*  40 */  NO_WAY,  /*  41 */  NO_WAY,  /*  42 */  NO_WAY,
            /*  43 */  NO_WAY,  /*  44 */  NO_WAY,  /*  45 */  NO_WAY,
            /*  46 */  NO_WAY,  /*  47 */  NO_WAY,  /*  48 */  NO_WAY,
            /*  49 */  NO_WAY,  /*  50 */  NO_WAY,  /*  51 */  NO_WAY,
            /*  52 */  NO_WAY,  /*  53 */  NO_WAY,  /*  54 */  NO_WAY,
            /*  55 */  NO_WAY,  /*  56 */  NO_WAY,  /*  57 */  NO_WAY,
            /*  58 */  NO_WAY,  /*  59 */  NO_WAY,  /*  60 */  NO_WAY,
            /*  61 */  NO_WAY,  /*  62 */  NO_WAY,  /*  63 */  NO_WAY,
            /*  64 */  NO_WAY,  /*  65 */  NO_WAY,  /*  66 */  NO_WAY,
            /*  67 */  NO_WAY,  /*  68 */  NO_WAY,  /*  69 */  NO_WAY,
            /*  70 */  NO_WAY,  /*  71 */  NO_WAY,  /*  72 */  NO_WAY,
            /*  73 */  NO_WAY,  /*  74 */  NO_WAY,  /*  75 */  NO_WAY,
            /*  76 */  NO_WAY,  /*  77 */  NO_WAY,  /*  78 */  NO_WAY,
            /*  79 */  NO_WAY,  /*  80 */  NO_WAY,  /*  81 */  NO_WAY,
            /*  82 */  NO_WAY,  /*  83 */  NO_WAY,  /*  84 */  NO_WAY,
            /*  85 */  NO_WAY,  /*  86 */  NO_WAY,  /*  87 */  NO_WAY,
            /*  88 */  NO_WAY,  /*  89 */  NO_WAY,  /*  90 */  NO_WAY,
            /*  91 */  NO_WAY,  /*  92 */  NO_WAY,  /*  93 */  NO_WAY,
            /*  94 */  NO_WAY,  /*  95 */  NO_WAY,  /*  96 */  NO_WAY,
            /*  97 */  NO_WAY,  /*  98 */  NO_WAY,  /*  99 */  NO_WAY,
            /* 100 */  NO_WAY,  /* 101 */  NO_WAY,  /* 102 */  NO_WAY,
            /* 103 */  NO_WAY,  /* 104 */  NO_WAY,  /* 105 */  NO_WAY,
            /* 106 */  NO_WAY,  /* 107 */  NO_WAY,  /* 108 */  NO_WAY,
            /* 109 */  NO_WAY,  /* 110 */  NO_WAY,  /* 111 */  NO_WAY,
            /* 112 */  NO_WAY,  /* 113 */  NO_WAY,  /* 114 */  NO_WAY,
            /* 115 */  NO_WAY,  /* 116 */  NO_WAY,  /* 117 */  NO_WAY,
            /* 118 */  NO_WAY,  /* 119 */  NO_WAY,  /* 120 */  NO_WAY,
            /* 121 */  NO_WAY,  /* 122 */  NO_WAY,  /* 123 */  NO_WAY,
            /* 124 */  NO_WAY,  /* 125 */  NO_WAY,  /* 126 */  NO_WAY,
            /* 127 */  NO_WAY,  /* 128 */  NO_WAY,  /* 129 */  NO_WAY,
1           /* 130 */  NO_WAY,  /* 131 */  NO_WAY,  /* 132 */  NO_WAY,
            /* 133 */  NO_WAY,  /* 134 */  NO_WAY,  /* 135 */  NO_WAY,
            /* 136 */  NO_WAY,  /* 137 */  NO_WAY,  /* 138 */  NO_WAY,
            /* 139 */  NO_WAY,  /* 140 */  NO_WAY,  /* 141 */  NO_WAY,
            /* 142 */  NO_WAY,  /* 143 */  NO_WAY,  /* 144 */  NO_WAY,
            /* 145 */  NO_WAY,  /* 146 */  NO_WAY,  /* 147 */  NO_WAY,
            /* 148 */  NO_WAY,  /* 149 */  NO_WAY,  /* 150 */  NO_WAY,
            /* 151 */  NO_WAY,  /* 152 */  NO_WAY,  /* 153 */  NO_WAY,
            /* 154 */  NO_WAY,  /* 155 */  NO_WAY,  /* 156 */  NO_WAY,
            /* 157 */  NO_WAY,  /* 158 */  NO_WAY,  /* 159 */  NO_WAY,
            /* 160 */  NO_WAY,  /* 161 */  NO_WAY,  /* 162 */  NO_WAY,
            /* 163 */  NO_WAY,  /* 164 */  NO_WAY,  /* 165 */  NO_WAY,
            /* 166 */  NO_WAY,  /* 167 */  NO_WAY,  /* 168 */  NO_WAY,
            /* 169 */  NO_WAY,  /* 170 */  NO_WAY,  /* 171 */  NO_WAY,
            /* 172 */  NO_WAY,  /* 173 */  NO_WAY,  /* 174 */  NO_WAY,
            /* 175 */  NO_WAY,  /* 176 */  NO_WAY,  /* 177 */  NO_WAY,
            /* 178 */  NO_WAY,  /* 179 */  NO_WAY,  /* 180 */  NO_WAY,
            /* 181 */  NO_WAY,  /* 182 */  NO_WAY,  /* 183 */  NO_WAY,
            /* 184 */  NO_WAY,  /* 185 */  NO_WAY,  /* 186 */  NO_WAY,
            /* 187 */  NO_WAY,  /* 188 */  NO_WAY,  /* 189 */  NO_WAY,
            /* 190 */  NO_WAY,  /* 191 */  NO_WAY,  /* 192 */  NO_WAY,
            /* 193 */  NO_WAY,  /* 194 */  NO_WAY,  /* 195 */  NO_WAY,
            /* 196 */  NO_WAY,  /* 197 */  NO_WAY,  /* 198 */  NO_WAY,
            /* 199 */  NO_WAY,  /* 200 */  NO_WAY,  /* 201 */  NO_WAY,
            /* 202 */  NO_WAY,  /* 203 */  NO_WAY,  /* 204 */  NO_WAY,
            /* 205 */  NO_WAY,  /* 206 */  NO_WAY,  /* 207 */  NO_WAY,
            /* 208 */  NO_WAY,  /* 209 */  NO_WAY,  /* 210 */  NO_WAY,
            /* 211 */  NO_WAY,  /* 212 */  NO_WAY,  /* 213 */  NO_WAY,
            /* 214 */  NO_WAY,  /* 215 */  NO_WAY,  /* 216 */  NO_WAY,
            /* 217 */  NO_WAY,  /* 218 */  NO_WAY,  /* 219 */  NO_WAY,
            /* 220 */  NO_WAY,  /* 221 */  NO_WAY,  /* 222 */  NO_WAY,
            /* 223 */  NO_WAY,  /* 224 */  NO_WAY,  /* 225 */  NO_WAY,
            /* 226 */  NO_WAY,  /* 227 */  NO_WAY,  /* 228 */  NO_WAY,
            /* 229 */  NO_WAY,  /* 230 */  NO_WAY,  /* 231 */  NO_WAY,
            /* 232 */  NO_WAY,  /* 233 */  NO_WAY,  /* 234 */  NO_WAY,
            /* 235 */  NO_WAY,  /* 236 */  NO_WAY,  /* 237 */  NO_WAY,
            /* 238 */  NO_WAY,  /* 239 */  NO_WAY,  /* 240 */  NO_WAY,
            /* 241 */  NO_WAY,  /* 242 */  NO_WAY,  /* 243 */  NO_WAY,
            /* 244 */  NO_WAY,  /* 245 */  NO_WAY,  /* 246 */  NO_WAY,
            /* 247 */  NO_WAY,  /* 248 */  NO_WAY,  /* 249 */  NO_WAY,
            /* 250 */  NO_WAY,  /* 251 */  NO_WAY,  /* 252 */  YES_DO,
            /* 253 */  NO_WAY,  /* 254 */  NO_WAY,  /* 255 */  NO_WAY,
            /* 256 */  NO_WAY,  /* 257 */  NO_WAY,  /* 258 */  NO_WAY,
            /* 259 */  NO_WAY,  /* 260 */  NO_WAY,  /* 261 */  NO_WAY,
1           /* 262 */  NO_WAY,  /* 263 */  NO_WAY,  /* 264 */  NO_WAY,
            /* 265 */  NO_WAY,  /* 266 */  NO_WAY,  /* 267 */  NO_WAY,
            /* 268 */  NO_WAY,  /* 269 */  NO_WAY,  /* 270 */  NO_WAY,
            /* 271 */  NO_WAY,  /* 272 */  NO_WAY,  /* 273 */  NO_WAY,
            /* 274 */  NO_WAY,  /* 275 */  NO_WAY,  /* 276 */  NO_WAY,
            /* 277 */  NO_WAY,  /* 278 */  NO_WAY,  /* 279 */  NO_WAY,
            /* 280 */  NO_WAY,  /* 281 */  NO_WAY,  /* 282 */  NO_WAY,
            /* 283 */  NO_WAY,  /* 284 */  NO_WAY,  /* 285 */  NO_WAY,
            /* 286 */  NO_WAY,  /* 287 */  NO_WAY,  /* 288 */  NO_WAY,
            /* 289 */  NO_WAY,  /* 290 */  NO_WAY,  /* 291 */  NO_WAY,
            /* 292 */  NO_WAY,  /* 293 */  NO_WAY,  /* 294 */  NO_WAY,
            /* 295 */  NO_WAY,  /* 296 */  NO_WAY,  /* 297 */  NO_WAY,
            /* 298 */  NO_WAY,  /* 299 */  NO_WAY,  /* 300 */  NO_WAY,
            /* 301 */  NO_WAY,  /* 302 */  NO_WAY,  /* 303 */  NO_WAY,
            /* 304 */  NO_WAY,  /* 305 */  NO_WAY,  /* 306 */  NO_WAY,
            /* 307 */  NO_WAY,  /* 308 */  NO_WAY,  /* 309 */  NO_WAY,
            /* 310 */  NO_WAY,  /* 311 */  NO_WAY,  /* 312 */  NO_WAY,
            /* 313 */  NO_WAY,  /* 314 */  NO_WAY,  /* 315 */  NO_WAY,
            /* 316 */  NO_WAY,  /* 317 */  NO_WAY,  /* 318 */  NO_WAY,
            /* 319 */  NO_WAY,  /* 320 */  NO_WAY,  /* 321 */  NO_WAY,
            /* 322 */  NO_WAY,  /* 323 */  NO_WAY,  /* 324 */  NO_WAY,
            /* 325 */  NO_WAY,  /* 326 */  NO_WAY,  /* 327 */  NO_WAY,
            /* 328 */  NO_WAY,  /* 329 */  NO_WAY,  /* 330 */  NO_WAY,
            /* 331 */  NO_WAY,  /* 332 */  NO_WAY,  /* 333 */  NO_WAY,
            /* 334 */  NO_WAY,  /* 335 */  NO_WAY,  /* 336 */  NO_WAY,
            /* 337 */  NO_WAY,  /* 338 */  NO_WAY,  /* 339 */  NO_WAY,
            /* 340 */  NO_WAY,  /* 341 */  NO_WAY,  /* 342 */  NO_WAY,
            /* 343 */  NO_WAY,  /* 344 */  NO_WAY,  /* 345 */  NO_WAY,
            /* 346 */  NO_WAY,  /* 347 */  NO_WAY,  /* 348 */  NO_WAY,
            /* 349 */  NO_WAY,  /* 350 */  NO_WAY,  /* 351 */  NO_WAY,
            /* 352 */  NO_WAY,  /* 353 */  NO_WAY,  /* 354 */  NO_WAY,
            /* 355 */  NO_WAY,  /* 356 */  NO_WAY,  /* 357 */  NO_WAY,
            /* 358 */  NO_WAY,  /* 359 */  NO_WAY,  /* 360 */  NO_WAY,
            /* 361 */  NO_WAY,  /* 362 */  NO_WAY,  /* 363 */  NO_WAY,
            /* 364 */  NO_WAY,  /* 365 */  NO_WAY);
1DECLARE  SYSIN  FILE INPUT  STREAM;
 DECLARE  IN     FILE INPUT  RECORD;
 DECLARE  OUT    FILE OUTPUT RECORD ENV(FB, RECSIZE(80), BLKSIZE(3120));

 DECLARE
     1  OPTIONS  STATIC,
        2  SEQ_INCR      FIXED BINARY(31) INIT(10),
        2  FLAGS,
           3  VARYOUT    BIT(1) INIT('0'B),
           3  LISTOUT    BIT(1) INIT('0'B),
           3  LISTONLY   BIT(1) INIT('0'B),
           3  COUNT      BIT(1) INIT('0'B),
           3  ALTINDENT  BIT(1) INIT('0'B),
           3  UNUSED6    BIT(1) INIT('0'B),
           3  UNUSED7    BIT(1) INIT('0'B),
           3  UNUSED8    BIT(1) INIT('0'B);

 OPEN FILE(SYSPRINT);

 SELECT(PARM);
     WHEN('DEFAULT');
     WHEN('') DO;
         FETCH PLIFCNT;
         CALL PLIFCNT(KEYWORD, ABREVIATION, CHOICE, SPACING, PGMID,
             OPTIONS, SYSIN);
         RELEASE PLIFCNT;
         END;
     WHEN('SCREEN') DO;
         FETCH PLIFSCR;
         CALL PLIFSCR(KEYWORD, ABREVIATION, CHOICE, SPACING, PGMID,
             OPTIONS);
         RELEASE PLIFSCR;
         END;
     OTHERWISE DO;
         FETCH PLIFPRM;
         CALL PLIFPRM(KEYWORD, ABREVIATION, CHOICE, SPACING, PGMID,
             OPTIONS, PARM);
         RELEASE PLIFPRM;
         END;
     END;

 FETCH PLIFEXC;
 CALL PLIFEXC(KEYWORD, ABREVIATION, CHOICE, SPACING, OPTIONS, IN, OUT);
 CLOSE FILE(SYSPRINT);

 END PLIFORM;
